
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.ВыбранныеМеста);
	
	Для каждого ВыборкаДетальныеЗаписи из ТЗ Цикл
		НоваяСтрока = КПереносу.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	ОповеститьОЗавершенииРаботыФормы();
КонецПроцедуры 
&НаКлиенте
Процедура ОповеститьОЗавершенииРаботыФормы()
	ОбновитьПорядок = Ложь;
	Адрес = ПолучитьАдресТЧ();
	ОповеститьОВыборе(Адрес);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьАдресТЧ()
	
	
	ТЗКПередаче = ЭтотОбъект.КПереносу.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТЗКПередаче);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КПереносу.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВыбранныеЦены.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

КонецПроцедуры


#КонецОбласти