
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПоказатьВопрос(Новый ОписаниеОповещения("ОбнЦ_ОбновитьЦеныДалее", ЭтотОбъект, Новый Структура("ПараметрыВыполненияКоманды,ПараметрКоманды", ПараметрыВыполненияКоманды,ПараметрКоманды)),
		НСтр("ru = 'Обновить цены?
              |'; uk = 'Оновити ціни?'"),
		РежимДиалогаВопрос.ДаНет,
		,
		,
		НСтр("ru = 'Обновить цены?'; uk = 'Оновити ціни?'")
	);

КонецПроцедуры

&НаКлиенте
Процедура ОбнЦ_ОбновитьЦеныДалее(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И ДопПараметры.Количество() > 0 Тогда

		Список = ПолучитьСписокТиповЦен(ПериодДокумента(ДопПараметры.ПараметрКоманды[0]));
		Если Список.Количество() Тогда
			Оповещение = Новый ОписаниеОповещения("ВыборТипаЦенДалее", ЭтотОбъект, ДопПараметры.ПараметрКоманды);
			
			Попытка
				ДопПараметры.ПараметрыВыполненияКоманды.Источник.ПоказатьВыборИзСписка(Оповещение, Список, ДопПараметры.ПараметрыВыполненияКоманды.Источник.Элементы.ФормаКоманднаяПанель);
			Исключение
				ДопПараметры.ПараметрыВыполненияКоманды.Источник.ПоказатьВыборИзСписка(Оповещение, Список, ДопПараметры.ПараметрыВыполненияКоманды.Источник.Элементы.ГруппаКоманднаяПанель);
			КонецПопытки;
		Иначе
			ВыборТипаЦенДалее(Неопределено, ДопПараметры.ПараметрКоманды);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПериодДокумента(Док)
	
	Возврат Док.а_Периоды;
	
КонецФункции

&НаКлиенте
Процедура ВыборТипаЦенДалее(Результат = Неопределено, ДопПараметры) Экспорт
	
	Кво = 1;
	Для Каждого Док Из ДопПараметры Цикл
		
		Состояние("Обробка документу",  Цел(100*Кво/ДопПараметры.Количество()), Док);
	
		ОбнЦ_ОбновитьЦеныНаСервере(Док, ?(не Результат = Неопределено, Результат.Значение, Неопределено));
		Кво = Кво + 1;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТиповЦен(Период)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыЦенНоменклатуры.а_Период КАК а_Период,
	               |	ТипыЦенНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	               |ГДЕ
	               |	ТипыЦенНоменклатуры.а_Период = &Период";
	Запрос.УстановитьПараметр("Период", Период);
	
	М = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(М);
	
	Возврат Список;
	
КонецФункции

&НаСервере
Процедура ОбнЦ_ОбновитьЦеныНаСервере(Ссылка, ТипЦен)
	
	ерпсАктПриемкиПередачиСервер.ОбнЦ_ОбновитьЦеныНаСервере(Ссылка, ТипЦен);
	
КонецПроцедуры