#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПунктРазгрузки(СтрИД, ОТГ = "") Экспорт
	
	СтрИД = Лев(СтрИД, 50);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИД", СтрИД);
	Запрос.УстановитьПараметр("ОТГ", ОТГ);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	а_СвязьОбъектов.Объект КАК Объект,
	               |	а_СвязьОбъектов.Объект.НаименованиеПолное КАК ОбъектНаименованиеПолное
	               |ИЗ
	               |	РегистрСведений.а_СвязьОбъектов КАК а_СвязьОбъектов
	               |ГДЕ
	               |	а_СвязьОбъектов.ИД = &ИД
	               |	И а_СвязьОбъектов.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.а_ТипыОбъектов.ПунктРазгрузки)
	               |	И ВЫБОР
	               |			КОГДА а_СвязьОбъектов.Объект.ОТГ <> """"
	               |					И &ОТГ <> """"
	               |				ТОГДА а_СвязьОбъектов.Объект.ОТГ = &ОТГ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект;
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции
	
#КонецЕсли