#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ЗаписатьПунктРазгрузкиВМаршрут(ПунктРазгрузки, Маршрут) Экспорт
	
	Если Не ЗначениеЗаполнено(ПунктРазгрузки) ИЛИ Не ЗначениеЗаполнено(Маршрут) Тогда
		Возврат;
	КонецЕсли;
	
	Об = Маршрут.Получитьобъект();
	МассивПунктовРазгрузки = Об.ПунктыРазгрузки.Выгрузить().ВыгрузитьКолонку("ПунктРазгрузки");
	
	Если МассивПунктовРазгрузки.Найти(ПунктРазгрузки) = Неопределено Тогда
		НовыйПунктРазгрузки = Об.ПунктыРазгрузки.Добавить();
		НовыйПунктРазгрузки.ПунктРазгрузки = ПунктРазгрузки;
		
		Попытка
			Об.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли