
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПутьСохранения = КаталогДокументов();
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогСохраненияФайла.ПолноеИмяФайла = СтрШаблон("Вивантаження видаткових накладних від %1", Формат(ТекущаяДата(), "ДФ=dd-MM-yyyy"));
	Фильтр = "Файл XML (*.xml)|*.xml";
	ДиалогСохраненияФайла.Фильтр = Фильтр;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = "Оберіть файл";
	ДиалогСохраненияФайла.Каталог = ПутьСохранения;
	Если ДиалогСохраненияФайла.Выбрать() Тогда

			ДобавитьВXML(ПараметрКоманды, ДиалогСохраненияФайла.ПолноеИмяФайла);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВXML(Доки, Путь)
	
	ЗаписьВФайл = Новый ЗаписьXML;
	ЗаписьВФайл.ОткрытьФайл(Путь, "UTF-8");
	ЗаписьВФайл.ЗаписатьОбъявлениеXML();
	ЗаписьВФайл.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	Для Каждого Док Из Доки Цикл
	#Если _ Тогда
		ЗаписьВФайл = Новый ЗаписьXML;
		Док = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	#КонецЕсли
	ЗаписьВФайл.ЗаписатьНачалоЭлемента("Документ");


	
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("ИД");
		ЗаписьВФайл.ЗаписатьТекст(СокрЛП(Док.УникальныйИдентификатор()));
		ЗаписьВФайл.ЗаписатьКонецЭлемента();	//ИД
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(Док, "Номер")));
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Дата");
		ЗаписьВФайл.ЗаписатьТекст(Формат(ЗначениеРеквизитаОбъекта(Док, "Дата"), "ДФ=yyyy-MM-dd"));
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("ХозОперация");
		ЗаписьВФайл.ЗаписатьТекст("Отпуск товара");
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Роль");
		ЗаписьВФайл.ЗаписатьТекст("Продавец");
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Организация");
			ЗаписьВФайл.ЗаписатьНачалоЭлемента("кодЕДРПОУ");
			ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(ЗначениеРеквизитаОбъекта(Док, "Организация"),"КодПоЕДРПОУ")));
			ЗаписьВФайл.ЗаписатьКонецЭлемента();
			ЗаписьВФайл.ЗаписатьНачалоЭлемента("Наименование");
			ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(ЗначениеРеквизитаОбъекта(Док, "Организация"), "НаименованиеПолное")));
			ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьКонецЭлемента();	// организация
		ДобавитьЗаписьЭлемента(ЗаписьВФайл, "КодПоставщика", СокрЛП(ЗначениеРеквизитаОбъекта(ЗначениеРеквизитаОбъекта(Док, "Организация"),"КодПоЕДРПОУ")));
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Валюта");
		ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(Док, "ВалютаДокумента")));
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Курс");
		ЗаписьВФайл.ЗаписатьТекст(Формат(ЗначениеРеквизитаОбъекта(Док,"КурсВзаиморасчетов")/ЗначениеРеквизитаОбъекта(Док,"КратностьВзаиморасчетов"), "ЧРД=.; ЧГ="));
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Сумма");
		ЗаписьВФайл.ЗаписатьТекст(Формат(ЗначениеРеквизитаОбъекта(Док,"СуммаДокумента"), "ЧРД=.; ЧГ="));
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Контрагенты");
			ЗаписьВФайл.ЗаписатьНачалоЭлемента("Контрагент");
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("ИД");
				
				спрКонтрагент = ЗначениеРеквизитаОбъекта(Док, "Контрагент");
				
				ЗаписьВФайл.ЗаписатьТекст(СокрЛП(спрКонтрагент.УникальныйИдентификатор()));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();	//ИД
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("Наименование");
				ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(спрКонтрагент,"НаименованиеПолное")));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("ОфициальноеНаименование");
				ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(спрКонтрагент,"НаименованиеПолное")));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("ПолноеНаименование");
				ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(спрКонтрагент,"НаименованиеПолное")));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЮридическийАдрес");
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("Представление");
					КонтактнаяИнформация = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(спрКонтрагент,
						ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"),
						ЗначениеРеквизитаОбъекта(Док,"Дата")
					);
					ЗаписьВФайл.ЗаписатьТекст(СокрЛП(КонтактнаяИнформация.Представление));
					ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьКонецЭлемента();  
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("Код");
				ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(спрКонтрагент,"Код")));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("ИНН");
				ЗаписьВФайл.ЗаписатьТекст(?(ЗначениеРеквизитаОбъекта(спрКонтрагент,"ЮридическоеФизическоеЛицо") = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"), ЗначениеРеквизитаОбъекта(спрКонтрагент,"КодПоЕДРПОУ"), ЗначениеРеквизитаОбъекта(спрКонтрагент,"ИНН")));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("АдресДоставки");
				ЗаписьВФайл.ЗаписатьТекст(СокрЛП(ЗначениеРеквизитаОбъекта(Док,"АдресДоставки")));
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("Вывеска");
				ЗаписьВФайл.ЗаписатьТекст("");
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("Роль");
				ЗаписьВФайл.ЗаписатьТекст("Покупатель");
				ЗаписьВФайл.ЗаписатьКонецЭлемента();
			ЗаписьВФайл.ЗаписатьКонецЭлемента();// Контрагент
		ЗаписьВФайл.ЗаписатьКонецЭлемента(); 	//Контрагенты
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Время");
		ЗаписьВФайл.ЗаписатьКонецЭлемента();
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Налоги");
		
		    ИтогНДС = ИтогТабличнойЧастиДокумента(Док, "Товары", "СуммаНДС");
			Если ИтогНДС > 0 Тогда
			ЗаписьВФайл.ЗаписатьНачалоЭлемента("Налог");
				ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "НДС");
				ДобавитьЗаписьЭлемента(ЗаписьВФайл, "УчтеноВСумма", ?(ЗначениеРеквизитаОбъекта(Док,"СуммаВключаетНДС"),"true", "false"));
				ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Сумма", Формат(ИтогНДС, "ЧРД=.; ЧГ="));
			ЗаписьВФайл.ЗаписатьКонецЭлемента();
			КонецЕсли;
		ЗаписьВФайл.ЗаписатьКонецЭлемента();	//Налоги
		ЗаписьВФайл.ЗаписатьНачалоЭлемента("Товары");
		
		тч = ТаблицаЗначенийВМассив(Док, "Товары");
		
			Для Каждого Товар Из тч Цикл
				ЗаписьВФайл.ЗаписатьНачалоЭлемента("Товар");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Ид", ?(ЗначениеЗаполнено(Товар.ДополнительныйАртикул), Товар.ДополнительныйАртикул, Товар.Номенклатура.УникальныйИдентификатор()));
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Штрихкод",);
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", ЗначениеРеквизитаОбъекта(Товар.Номенклатура, "Наименование"));
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "УКТЗЕД", );
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("БазоваяЕдиница");
					
					БазЕд = ЗначениеРеквизитаОбъекта(Товар.Номенклатура,"БазоваяЕдиницаИзмерения");
					 
					ЗаписьВФайл.ЗаписатьАтрибут("Код", ЗначениеРеквизитаОбъекта(БазЕд,"Код"));
					ЗаписьВФайл.ЗаписатьАтрибут("НаименованиеПолное", ЗначениеРеквизитаОбъекта(БазЕд,"НаименованиеПолное"));
					
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("Пересчет");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Единица", ЗначениеРеквизитаОбъекта(БазЕд,"Наименование"));
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Коэффициент",);
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ДополнительныеДанные");

					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Вес", Формат(ЗначениеРеквизитаОбъекта(БазЕд,"Вес"), "ЧРД=.; ЧГ="));
					ЗаписьВФайл.ЗаписатьКонецЭлемента();//ЗначениеРеквизита

					ЗаписьВФайл.ЗаписатьКонецЭлемента();//ДополнительныеДанные
					ЗаписьВФайл.ЗаписатьКонецЭлемента();//Пересчет
					
					ЗаписьВФайл.ЗаписатьТекст(ЗначениеРеквизитаОбъекта(Товар.ЕдиницаИзмерения,"Наименование"));
					ЗаписьВФайл.ЗаписатьКонецЭлемента();//БазоваяЕдиница
					
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("СтавкиНалогов");
						Если ЗначениеЗаполнено(Товар.СтавкаНДС) И УчетНДС.ПолучитьСтавкуНДС(Товар.СтавкаНДС) <> 0 Тогда
							ЗаписьВФайл.ЗаписатьНачалоЭлемента("СтавкаНалогов");
							ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "НДС");
							ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Ставка", СтрШаблон("%1%2", УчетНДС.ПолучитьСтавкуНДС(Товар.СтавкаНДС), "%"));
							ЗаписьВФайл.ЗаписатьКонецЭлемента();
						КонецЕсли;
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //СтавкиНалогов
					
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "ВидНоменклатуры");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Значение", "Товары");
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //ЗначениеРеквизита
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "ТипНоменклатуры");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Значение", "Товар");
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //ЗначениеРеквизита
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "НаименованиеКраткое");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Значение", ЗначениеРеквизитаОбъекта(Товар.Номенклатура, "Наименование"));
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //ЗначениеРеквизита
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "НаименованиеПолное");
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Значение", ЗначениеРеквизитаОбъекта(Товар.Номенклатура, "НаименованиеПолное"));
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //ЗначениеРеквизита
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //ЗначенияРеквизитов
					
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "ИдКаталога",);
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "ЦенаЗаЕдиницу", Формат(Товар.Цена, "ЧРД=.; ЧГ="));
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Количество", Формат(Товар.Количество, "ЧРД=.; ЧГ="));
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Сумма",Формат(Товар.Сумма, "ЧРД=.; ЧГ="));
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Единица",Товар.ЕдиницаИзмерения);
					ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Коэффициент",Товар.Коэффициент);
					ЗаписьВФайл.ЗаписатьНачалоЭлемента("Налоги");
						Если ЗначениеЗаполнено(Товар.СтавкаНДС) И УчетНДС.ПолучитьСтавкуНДС(Товар.СтавкаНДС) <> 0 Тогда
							ЗаписьВФайл.ЗаписатьНачалоЭлемента("Налог");
							ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Наименование", "НДС");
							ДобавитьЗаписьЭлемента(ЗаписьВФайл, "УчтеноВСумме", ?(ЗначениеРеквизитаОбъекта(Док,"СуммаВключаетНДС"),"true", "false"));
							ДобавитьЗаписьЭлемента(ЗаписьВФайл, "Сумма", Товар.СуммаНДС);
							ЗаписьВФайл.ЗаписатьКонецЭлемента();
						КонецЕсли;
					ЗаписьВФайл.ЗаписатьКонецЭлемента(); //Налоги


				ЗаписьВФайл.ЗаписатьКонецЭлемента();
			КонецЦикла;
		ЗаписьВФайл.ЗаписатьКонецЭлемента(); //товары
		
ЗаписьВФайл.ЗаписатьКонецЭлемента();	//Документ	
	КонецЦикла;
ЗаписьВФайл.ЗаписатьКонецЭлемента();	//КоммерческаяИнформация
	ЗаписьВФайл.Закрыть();

	

КонецПроцедуры

&НаСервере
Функция ИтогТабличнойЧастиДокумента(Док, ТабЧасть, КолонкаИтога)
	Возврат Док[ТабЧасть].Итог(КолонкаИтога);
КонецФункции

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
КонецФункции

&НаСервере
Функция ТаблицаЗначенийВМассив(Док, ТабЧасть)
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Док[ТабЧасть].Выгрузить());
КонецФункции

&НаКлиентеНаСервере
Процедура ДобавитьЗаписьЭлемента(Запись, ИмяЭлемента, Текст = "")
	Запись.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	Если Не ПустаяСтрока(Текст) Тогда
		Запись.ЗаписатьТекст(СокрЛП(Текст));
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры
