Процедура УстановитьВидимостьРеквизита(ЭтаФорма,ИмяРеквизита, ЗначениеПараметра) Экспорт
	
	УстановитьСвойстваРеквизита(ЭтаФорма, ИмяРеквизита, ЗначениеПараметра);
		
КонецПроцедуры

Процедура УстановитьСвойстваРеквизита(ЭтаФорма, ИмяРеквизита, Видимость = Неопределено, Доступность = Неопределено, ТолькоПросмотр = Неопределено, Заголовок = Неопределено, ЦветФонаЗаголовка = Неопределено, ЦветФона = Неопределено) Экспорт
	
	Если СтрНайти(ИмяРеквизита,",") Тогда
		
		СтруктураРеквизитов = Новый Структура(ИмяРеквизита);
		Для Каждого ТекЭлемент из СтруктураРеквизитов Цикл
			УстановитьСвойстваРеквизита(ЭтаФорма,ТекЭлемент.Ключ,Видимость, Доступность, ТолькоПросмотр, Заголовок);
		КонецЦикла;
		
	Иначе
		
		Если ЭтаФорма.Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			Возврат;
		КонецЕсли;
	
		Если Видимость <> Неопределено Тогда
			ЭтаФорма.Элементы[ИмяРеквизита].Видимость = Видимость;
		КонецЕсли;
		Если Доступность <> Неопределено Тогда
			ЭтаФорма.Элементы[ИмяРеквизита].Доступность = Доступность;
		КонецЕсли;
		Если ТолькоПросмотр <> Неопределено Тогда
			ЭтаФорма.Элементы[ИмяРеквизита].ТолькоПросмотр = ТолькоПросмотр;
			Если ТолькоПросмотр Тогда
				ЭтаФорма.Элементы[ИмяРеквизита].ЦветРамки = WebЦвета.Серый;
			КонецЕсли;
		КонецЕсли;
		Если Заголовок <> Неопределено Тогда
			ЭтаФорма.Элементы[ИмяРеквизита].Заголовок = Заголовок;
		КонецЕсли;
		Если ЦветФонаЗаголовка <> Неопределено Тогда
			ЭтаФорма.Элементы[ИмяРеквизита].ЦветФонаЗаголовка = ЦветФонаЗаголовка;
		КонецЕсли;
		Если ЦветФона <> Неопределено Тогда
			ЭтаФорма.Элементы[ИмяРеквизита].ЦветФона = ЦветФона;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Процедура Пауза(КвоСекунд) Экспорт
//	
//	Если КвоСекунд = 0 Тогда
//        Возврат
//	КонецЕсли;
//	
//	//ЗаписьЖурналаРегистрации("Пауза", УровеньЖурналаРегистрации.Информация, , , "Пауза " + КвоСекунд + " секунд");
//	
//	Сообщить("[" + ТекущаяДата() +  "] Пауза " + КвоСекунд + " секунд");
//	СтрокаЗапроса 	= "ping -n 1 -w " + Формат(1000 * КвоСекунд, "ЧГ=0") + " 127.255.255.255"; // с этим IP стабильно работает по Windows 7
//	Соединение 		= Новый COMОбъект("WScript.Shell");
//	Соединение.Run(СтрокаЗапроса, 0, -1);
//	Сообщить("[" + ТекущаяДата() +  "] Продолжение работы...");
//	
//КонецПроцедуры

Процедура УстановитьДоступностьРеквизита(ЭтаФорма,ИмяРеквизита, ЗначениеПараметра) Экспорт
	
	УстановитьСвойстваРеквизита(ЭтаФорма, ИмяРеквизита,,ЗначениеПараметра);
		
КонецПроцедуры

