
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьПараметрыСервер();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСервер()
	
	//ТекНастройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")); 
	Настройки.Значение.ДатаНачала = Период.ДатаНачала;
	Настройки.Значение.ДатаОкончания = Период.ДатаОкончания;
	Настройки.Использование = Истина;
	Если ЗначениеЗаполнено(Настройки.ИдентификаторПользовательскойНастройки) Тогда	
		ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		   Настройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Настройки.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодНачало")); 
	Настройки.Значение = Период.ДатаНачала;
	Настройки.Использование = Истина;
	Если ЗначениеЗаполнено(Настройки.ИдентификаторПользовательскойНастройки) Тогда	
		ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		   Настройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Настройки.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодКонец")); 
	Настройки.Значение = Период.ДатаОкончания;
	Настройки.Использование = Истина;
	Если ЗначениеЗаполнено(Настройки.ИдентификаторПользовательскойНастройки) Тогда	
		ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		   Настройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Настройки.Значение;
		КонецЕсли;
	КонецЕсли;
	//ТекНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодНачало", Период.ДатаНачала);
	//ТекНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодКонец", Период.ДатаОкончания);
	
	Заявки = ПолучитьДокументыВывозаНаСервере();
	Если не Заявки = Неопределено Тогда
		Настройки = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заявка"));
		Настройки.Значение.ЗагрузитьЗначения(Заявки.ВыгрузитьКолонку("Заявка"));
		Настройки.Использование = Истина;
		Если ЗначениеЗаполнено(Настройки.ИдентификаторПользовательскойНастройки) Тогда	
			ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			   Настройки.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				ПользовательскийПараметр.Значение = Настройки.Значение;
			КонецЕсли;
		КонецЕсли;
		//ТекНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заявка", Заявки.ВыгрузитьКолонку("Заявка"));
	КонецЕсли;
	
	//Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ТекНастройки);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДокументыВывозаНаСервере()
	
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
		Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
		Запрос.Текст = "ВЫБРАТЬ
		               |	а_ЗаявкиКВывозу.Объект КАК Заявка
		               |ИЗ
		               |	РегистрСведений.а_ЗаявкиКВывозу КАК а_ЗаявкиКВывозу
		               |ГДЕ
		               |	а_ЗаявкиКВывозу.Объект.Дата МЕЖДУ &Дата1 И &Дата2";
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;                                                  
	
КонецФункции




