Перем ИмяБазы;

//Процедура ПриОткрытии()
//	
//	ИмяБазы=Метаданные.Имя;
//	Если 	  Найти(ИмяБазы, "БухгалтерияДляУкраины")=1 Тогда ИмяБазы="БУ"
//	ИначеЕсли Найти(ИмяБазы, "УправлениеПроизводственнымПредприятиемДляУкраины")=1 Тогда  ИмяБазы="УПП"
//	ИначеЕсли Найти(ИмяБазы, "УправлениеТорговымПредприятиемДляУкраины")=1 Тогда ИмяБазы="УТП"
//	ИначеЕсли Найти(ИмяБазы, "УправлениеТорговлейДляУкраины")=1 Тогда ИмяБазы="УТ"
//	КонецЕсли;
//	
//	Если ИмяБазы = "УТП" Тогда 
//		КонецЕсли;
//КонецПроцедуры	
&НаКлиенте	
Процедура Добавить(Команда)
	// Вставить содержимое обработчика.
	СохранитьНаСерв();	  	
	Закрыть();	
КонецПроцедуры


Процедура СохранитьНаСерв()
	ХранилищеОбщихНастроек.Сохранить("МаркаАвто",,ЭтаФорма.МаркаАвто);
	ХранилищеОбщихНастроек.Сохранить("НомерАвто",,ЭтаФорма.НомерАвто);
	ХранилищеОбщихНастроек.Сохранить("ТипАвто",,ЭтаФорма.ТипАвто);
	ХранилищеОбщихНастроек.Сохранить("МаркаПриц",,ЭтаФорма.МаркаПриц);
	ХранилищеОбщихНастроек.Сохранить("НомерПриц",,ЭтаФорма.НомерПриц);
	ХранилищеОбщихНастроек.Сохранить("ТипПриц",,ЭтаФорма.ТипПриц);
	ХранилищеОбщихНастроек.Сохранить("ЗакажчикАлко",,ЭтаФорма.ЗакажчикАлко);
	ХранилищеОбщихНастроек.Сохранить("ПеревожчикАлко",,ЭтаФорма.ПеревожчикАлко);
	ХранилищеОбщихНастроек.Сохранить("ВодФИО",,ЭтаФорма.ВодФИО);
	ХранилищеОбщихНастроек.Сохранить("УдостоверениеВод",,ЭтаФорма.УдостоверениеВод);
	ХранилищеОбщихНастроек.Сохранить("ПунктПогрузкиАлкоН",,ЭтаФорма.ПунктПогрузкиАлкоН);//Название
	ХранилищеОбщихНастроек.Сохранить("ПунктПогрузкиАлкоА",,ЭтаФорма.ПунктПогрузкиАлкоА); //Адресс
	ХранилищеОбщихНастроек.Сохранить("СопроводДокумент",,ЭтаФорма.СопроводДокумент);
	ХранилищеОбщихНастроек.Сохранить("ГрузополучательФИО",,ЭтаФорма.ГрузополучательФИО);
	ХранилищеОбщихНастроек.Сохранить("АкцизныйПодаток",,ЭтаФорма.АкцизныйПодаток);
КонецПроцедуры
	