#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	// Test{20231017 установка стилей
	Если ИменаПараметровСеанса = Неопределено Тогда
		стр = СтрокаСоединенияИнформационнойБазы();
		ВыбранноеИмяСтиля = Неопределено;
		Если СтрНайти(стр, "dev") > 0 Тогда
			ВыбранноеИмяСтиля = "Упр";
		ИначеЕсли СтрНайти(стр, "test") > 0 Тогда
			ВыбранноеИмяСтиля = "Упр";
		ИначеЕсли СтрНайти(стр, "sklad") > 0 Тогда
			ВыбранноеИмяСтиля = "Склад";
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыбранноеИмяСтиля) Тогда		
			ГлавныйСтиль = БиблиотекаСтилей[ВыбранноеИмяСтиля];
		КонецЕсли;
	КонецЕсли;
	// Test}
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// ТехнологияСервиса
	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли