
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьЗаголовкиТаблицФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	//ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


#Область СлужебныеПроцедурыИФункцииБСП

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

&НаКлиенте
Процедура ПоставщикиПриИзменении(Элемент)
	ОбновитьЗаголовкиТаблицФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ОбновитьЗаголовкиТаблицФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСведенияПриИзменении(Элемент)
	ОбновитьЗаголовкиТаблицФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Данные = Элементы.Товары.ТекущиеДанные;
    Если НоваяСтрока Тогда 
        Данные.Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДопПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Данные = Элементы.Товары.ТекущиеДанные;
    ТекДанные = Элементы.ТоварыДоп.ТекущиеДанные;
    Если НоваяСтрока Тогда
        ТекДанные.Идентификатор = Данные.Идентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)

	Данные = Элементы.Товары.ТекущиеДанные;
    Отбор = Новый Структура("Идентификатор",Данные.Идентификатор);
    Масс = Объект.ТоварыДоп.НайтиСтроки(Отбор);
    Для каждого Строка из Масс Цикл
        Объект.ТоварыДоп.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)

    Данные = Элементы.Товары.ТекущиеДанные;
    Если Данные = Неопределено Тогда
        Возврат;
	КонецЕсли;
	Отбор = Новый Структура("Идентификатор", Данные.Идентификатор);
    Элементы.ТоварыДоп.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
    //Элементы.ТоварыДоп.ОтборСтрок.Идентификатор.Использование = истина;

КонецПроцедуры

&НаКлиенте
Процедура БиркаНаТовар(Команда)
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Для Каждого С Из ВыделенныеСтроки Цикл
		//Если Не ТекДанные = Неопределено Тогда
			ТабДок = ПолучитьБиркуНаТоварНаСервере(С);
			ТабДок.Показать();
		//КонецЕсли;
	КонецЦикла;
	

	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьБиркуНаТоварНаСервере(С)
	
	Возврат Документы.а_ДекларацияПоставщика.ПолучитьБиркуНаТоварНаСервере(С, Объект);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЗаголовкиТаблицФормы()
	
	ТекЗаголовок = НСтр("ru = 'Поставщики'; uk = 'Постачальники'");
	Если Объект.Поставщики.Количество() Тогда
		Элементы.ГруппаПоставщики.Заголовок = СтрШаблон("%1 (%2)", ТекЗаголовок, Объект.Поставщики.Количество());
	Иначе
		Элементы.ГруппаПоставщики.Заголовок = ТекЗаголовок;
	КонецЕсли;
	
	ТекЗаголовок = НСтр("ru = 'Товары'; uk = 'Товари'");
	Если Объект.Товары.Количество() Тогда
		Элементы.ГруппаТовар.Заголовок = СтрШаблон("%1 (%2)", ТекЗаголовок, Объект.Товары.Количество());
	Иначе
		Элементы.ГруппаТовар.Заголовок = ТекЗаголовок;
	КонецЕсли;
	
	ТекЗаголовок = НСтр("ru = 'Доп сведения'; uk = 'Висновики'");
	Если Объект.ДополнительныеСведения.Количество() Тогда
		Элементы.ГруппаДопСведения.Заголовок = СтрШаблон("%1 (%2)", ТекЗаголовок, Объект.ДополнительныеСведения.Количество());
	Иначе
		Элементы.ГруппаДопСведения.Заголовок = ТекЗаголовок;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 
