
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ерпсАктПриемкиПередачиСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект,"Товары");
	
	Если Ответственный.Пустая() тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Дата 		  = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	//Ответственный = Пользователи.ТекущийПользователь();
	//Дата 		  = ТекущаяДата();
	//Авто		  = Справочники.Авто.ПустаяСсылка();
	//МаксимальныйКодСтроки = 0;
	//Товары.Очистить();
	//ПунктыРазгрузки.Очистить();
	
КонецПроцедуры

