Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	//Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
	//	И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
	//	ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регістр а_ДатаВывозаФакт
	Движения.а_ДатаВывозаФакт.Записывать = Истина;
	Для Каждого ТекСтрокаПунктыРазгрузки Из ПунктыРазгрузки Цикл
		Движение = Движения.а_ДатаВывозаФакт.Добавить();
		Движение.Объект = ТекСтрокаПунктыРазгрузки.Заявка;
		Движение.Идентификатор = ТекСтрокаПунктыРазгрузки.Идентификатор;
		Движение.ДатаОтгрузки = ТекСтрокаПунктыРазгрузки.ДатаОтгрузки;
		Движение.Водитель = ТекСтрокаПунктыРазгрузки.Водитель;
		Движение.Авто = ТекСтрокаПунктыРазгрузки.Авто;
		Движение.Прицеп = ТекСтрокаПунктыРазгрузки.Прицеп;
		Движение.Перевозчик = ТекСтрокаПунктыРазгрузки.Перевозчик;
		
		Если ТекСтрокаПунктыРазгрузки.СтатусОбработан Тогда
			Менеджер = РегистрыСведений.а_СтатусыЗаявок.СоздатьМенеджерЗаписи();
			Менеджер.Объект = ТекСтрокаПунктыРазгрузки.Заявка;
			Менеджер.Идентификатор = ТекСтрокаПунктыРазгрузки.Идентификатор;
			Менеджер.ТипСтатуса = Перечисления.а_ТипыСтатусов.СтатусВывоза;
			Менеджер.СтатусОбработан = Истина;
			Попытка
				Менеджер.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого ТекСтрокаПунктыРазгрузки Из ПунктыРазгрузки Цикл
		Менеджер = РегистрыСведений.а_СтатусыЗаявок.СоздатьМенеджерЗаписи();
		Менеджер.Объект = ТекСтрокаПунктыРазгрузки.Заявка;
		Менеджер.Идентификатор = ТекСтрокаПунктыРазгрузки.Идентификатор;
		Менеджер.ТипСтатуса = Перечисления.а_ТипыСтатусов.СтатусВывоза;
		Менеджер.СтатусОбработан = Ложь;
		Попытка
			Менеджер.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры


Процедура ЗаполнитьМаршруты() Экспорт
	
	Если Не ЗначениеЗаполнено(ПериодОтгрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Период отгрузки не заполнен - будет заполнено за все периоды.'; uk = 'Період відвантаження не заповнено - буде заповнено по всіх періодах.'"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Регион) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Регион не заполнен. Будет заполнено по всем регионам.'; uk = 'Регіон не заповнено. Буде заповнено по всіх регіонах.'"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодОтгрузки", ПериодОтгрузки);
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка КАК Заявка,
	               |	Заявка.НомерСтроки КАК НомерСтроки,
	               |	Заявка.ПунктРазгрузки КАК ПунктРазгрузки,
	               |	Заявка.Контрагент КАК Контрагент,
	               |	Заявка.Договор КАК Договор,
	               |	Заявка.Идентификатор КАК Идентификатор,
	               |	Заявка.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	Заявка.Количество КАК Количество,
	               |	Заявка.Организация КАК Организация,
	               |	Заявка.Водитель КАК Водитель,
	               |	Заявка.Авто КАК Авто,
	               |	Заявка.Прицеп КАК Прицеп,
	               |	Заявка.Перевозчик КАК Перевозчик,
	               |	Заявка.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	Заявка.КонтактныеДанные КАК КонтактныеДанные,
	               |	Заявка.Склад КАК Склад,
	               |	Заявка.Обработано КАК Обработано,
	               |	Заявка.Статус КАК Статус,
	               |	Заявка.Регион КАК Регион,
	               |	Заявка.СтадияОбработан КАК СтадияОбработан,
	               |	Заявка.СтадияПечатьСклад КАК СтадияПечатьСклад,
	               |	Заявка.СтадияГотовыеДокументы КАК СтадияГотовыеДокументы,
	               |	Заявка.СтадияВыполнена КАК СтадияВыполнена,
	               |	Заявка.Стадия5 КАК Стадия5,
	               |	Заявка.Стадия6 КАК Стадия6,
	               |	Заявка.ЗаказНаЗборку КАК ЗаказНаЗборку
	               |ИЗ
	               |	Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.ПунктыРазгрузки КАК Заявка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.а_ЗаявкиКВывозу КАК ЗаявкиКВывозу
	               |		ПО Заявка.Ссылка = ЗаявкиКВывозу.Объект
	               |ГДЕ
	               |	Заявка.Ссылка.ПериодОтгрузки = &ПериодОтгрузки
	               |	И Заявка.Регион = &Регион
	               |	И Заявка.Организация = &Организация";
	
	ПунктыРазгрузки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


