
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПолучитьМаршрутНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПолучитьМаршрутНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(, Маршрут);
КонецПроцедуры


&НаСервере
Процедура ПолучитьМаршрутНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	а_МаршрутыПунктыРазгрузки.Ссылка КАК Маршрут
	               |ИЗ
	               |	Справочник.а_Маршруты.ПунктыРазгрузки КАК а_МаршрутыПунктыРазгрузки
	               |ГДЕ
	               |	а_МаршрутыПунктыРазгрузки.ПунктРазгрузки = &ПунктРазгрузки";
	Запрос.УстановитьПараметр("ПунктРазгрузки", объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Маршрут = Выборка.Маршрут;
	КонецЕсли;
	
КонецПроцедуры



