
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыДинамическихСписков();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()
	
	День = 86400;	
	
	//ПользовательскиеНастройкиКомпоновкиДанных = СписокЗаказНаСборку.КомпоновщикНастроек.ПользовательскиеНастройки;
	//ЭлементОтбора = ПользовательскиеНастройкиКомпоновкиДанных.Элементы[2];
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса()) - 3*День;
	//
	//ЭлементОтбора = ПользовательскиеНастройкиКомпоновкиДанных.Элементы[3];
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	//ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса()) + 4*День;
	//
	//ЭлементОтбора = ПользовательскиеНастройкиКомпоновкиДанных.Элементы[1];
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементОтбора.ПравоеЗначение = Пользователи.ТекущийПользователь(); 
	
	ЭлементОтбора = СписокЗаказНаСборку.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса()) - 3*День;
	
	ЭлементОтбора = СписокЗаказНаСборку.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса()) + 4*День;
	
	ЭлементОтбора = СписокЗаказНаСборку.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Кладовщик");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Пользователи.ТекущийПользователь();

КонецПроцедуры
