 
 
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УстановитьДоступностьЭлементовФормы();
	
	Элементы.Утвердить.Пометка = Объект.Утвержден;
	Элементы.ГруппаДатаНомер.ЦветФона = ?(Объект.Утвержден, WebЦвета.БледноЗеленый, WebЦвета.Белый);
	
	ЗаполнитьЗначенияПоУмолчанию();
	
	// Test{20230914
	Попытка
		//ЗаблокироватьДанныеФормыДляРедактирования();
		ЗаблокироватьДокументНаСервере();
	Исключение
		ОписаниеБлокировки = ОписаниеОшибки();
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецПопытки;
	// Test}
	
	ОбновитьДатуВывозаФакт();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		ПоказатьОповещениеПользователя(
			Сред(ОписаниеБлокировки, СтрНайти(ОписаниеБлокировки, НСтр("ru = 'Объект уже заблокирован'; uk = 'Об’єкт вже заблокований'")), СтрДлина(ОписаниеБлокировки))
			,,, БиблиотекаКартинок.Внимание48, СтатусОповещенияПользователя.Важное, УникальныйИдентификатор
		);
	КонецЕсли;
	
	ВыделениеНоменклатурыИзменениеКоличества();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Test{20230914
	Попытка
		РазблокироватьДокументНаСервере();
	Исключение
	КонецПопытки;
	// Test}
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьДокументНаСервере()
	
	Если объект.Ссылка.Пустая() тогда
		возврат;
	КонецЕсли;
	
	ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка,, УникальныйИдентификатор);

КонецПроцедуры


&НаСервере
Процедура РазблокироватьДокументНаСервере()

	РазблокироватьДанныеДляРедактирования(Объект.Ссылка, УникальныйИдентификатор);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыОбработки = ПодготовитьПараметрыОбработкиТоварыНоменклатураПриИзменении(ТекущиеДанные);

	ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыОбработки.ДанныеСтрокиТаблицы);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПараметрыОбработки.ДанныеСтрокиТаблицы);
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ДанныеСтрокиТаблицы)

	Если НЕ ДанныеСтрокиТаблицы.Свойство("Номенклатура") тогда
		Возврат;
	КонецЕсли;  
	
	Если ДанныеСтрокиТаблицы.Свойство("ЕдиницаИзмерения") тогда
		
		ДанныеСтрокиТаблицы.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтрокиТаблицы.Номенклатура,"БазоваяЕдиницаИзмерения");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтрокиТаблицы.Номенклатура) 
		И ДанныеСтрокиТаблицы.Свойство("ДополнительныеАртикулы") Тогда
		ДанныеСтрокиТаблицы.ДополнительныеАртикулы = Справочники.ДополнительныеАртикулы.НайтиАртикул(ДанныеСтрокиТаблицы.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТоварыКоличествоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПунктыРазгрузкиПунктРазгрузкиПриИзменении(Элемент)
	ЗаполнитьКонтактнымиДаннымиНаСервере(Элементы.ПунктыРазгрузки.ТекущаяСтрока);
	
	ТекДанные = Элементы.ПунктыРазгрузки.ТекущиеДанные;
	ТЧТоварыИзменитьПунктОтгрузки(ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки, ТекДанные.Идентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнымиДаннымиНаСервере(ТекущаяСтрока)
	Об = РеквизитФормыВЗначение("Объект");
	ЗаполнитьКонтактнымиДанными(Объект.ПунктыРазгрузки.НайтиПоИдентификатору(ТекущаяСтрока).Идентификатор, Об);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПунктыРазгрузкиВодительПриИзменении(Элемент)
	ПунктыРазгрузкиВодительПриИзмененииНаСервере(Элементы.ПунктыРазгрузки.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ПунктыРазгрузкиВодительПриИзмененииНаСервере(Эл)
	Об = РеквизитФормыВЗначение("Объект"); 
	Попытка
		ИдентификаторСтроки = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(Эл).Идентификатор;
	Исключение
	КонецПопытки;
	ЗаполнитьДаннымиСотрудника(Эл, Об, ИдентификаторСтроки);                                                 

	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПунктыРазгрузки(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОбновленияТаблицыПунктыРазгрузки", ЭтотОбъект),
		НСтр("ru = 'Обновить данные в таблице из таблицы Товары?'; uk = 'Оновити дані в таблиці з таблиці Товари?'"),
		РежимДиалогаВопрос.ДаНет,
	);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявку(Команда)

	СтруктураПараметров = Новый Структура;
	
	ЗаголовокВыбора = НСтр("ru = 'Выберите настройку загрузки'; uk = 'Оберіть налаштування завантаження'");
	ОповещениеВыбор = Новый ОписаниеОповещения("ОкончаниеВыбораНастройкиЗагрузки", ЭтотОбъект, СтруктураПараметров);
	
	ПоказатьВводЗначения(ОповещениеВыбор,
		ПредопределенноеЗначение("Справочник.а_НастройкиЗагрузкиЗаявок.ПустаяСсылка"),
		ЗаголовокВыбора,
		Тип("СправочникСсылка.а_НастройкиЗагрузкиЗаявок")
	);
	
КонецПроцедуры 

&НаКлиенте
Процедура Обработано(Команда)
	
	ВыделенныеСтроки = Неопределено;
	ТекТЧ = "ПунктыРазгрузки";	
	ТабЧасть = "Товары";
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПунктыРазгрузки Тогда
		ТекТЧ = "ПунктыРазгрузки";
		ТабЧасть = "Товары";
		ВыделенныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	Иначе
		ТекТЧ = "Товары";
		ТабЧасть = "ПунктыРазгрузки";
		ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	КонецЕсли;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого С Из ВыделенныеСтроки Цикл
		ТекДанные = Объект[ТекТЧ].НайтиПоИдентификатору(С);
		Если Не ТекДанные = Неопределено Тогда
			УстановитьОбработаноНаСервере(ТабЧасть, ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки, ТекДанные.Идентификатор, Не ТекДанные.Обработано);
			ТекДанные.Обработано = Не ТекДанные.Обработано;
		КонецЕсли;
	КонецЦикла;
	
	
	//Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПунктыРазгрузки Тогда
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаСоздатьЗаказНаСБоркуЗавершение", ЭтотОбъект, Элементы.ПунктыРазгрузки.ВыделенныеСтроки),
	//		НСтр("ru = 'Создать заказ на сборку?'; uk = 'Створити замовлення на збірку?'"),
	//		РежимДиалогаВопрос.ДаНет,
	//		,
	//		,
	//	);
	//КонецЕсли;
	Для Каждого С Из Элементы.ПунктыРазгрузки.ВыделенныеСтроки Цикл	
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(С);
		Состояние(СтрШаблон("%1 от %2", ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки));
		Если Не ТекДанные = Неопределено Тогда
			Если ТекДанные.Обработано Тогда
				СоздатьЗаказНаСборкуНаСервере(ТекДанные.Идентификатор, ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки, ТекДанные.ЗаказНаЗборку); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявкиПоВодителю(Команда)
	
	ТекДанные = Элементы.ИтогиПоВодителям.ТекущиеДанные;
	ТабДок = ПечатьЗаявкиНаСервере(ТекДанные.Водитель, ТекДанные.Авто);
	ТабДок.Показать("Заявка_"+СокрЛП(ТекДанные.Водитель));
		
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРНПоВодителю(Команда)
	ТекДанные = Элементы.ИтогиПоВодителям.ТекущиеДанные;
	ТабДок = ПечатьРННаСервере(ТекДанные.Водитель, ТекДанные.Авто);
	ТабДок.Показать("РН_"+СокрЛП(ТекДанные.Водитель)+"_"+СокрЛП(ТекДанные.Авто));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРНПоПР(Команда)
	
	ВыбранныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	Массив = Новый Массив;
	Для Каждого Эл Из ВыбранныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(Эл);
		Если Не ТекДанные = Неопределено Тогда
			Массив.Добавить(ТекДанные.ПунктРазгрузки);                    
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(Массив);
	
	Если Массив.Количество() Тогда
		ТабДок = ПечатьРННаСервере(,, Массив);
		ТабДок.Показать("РН_"+СокрЛП(ТекДанные.Водитель)+"_"+СокрЛП(ТекДанные.Авто));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьТТНПоВодителю(Команда)
	ТекДанные = Элементы.ИтогиПоВодителям.ТекущиеДанные;
	ТабДок = ПечатьТТТННаСервере(ТекДанные.Водитель, ТекДанные.Авто);
	ТабДок.Показать("РН_"+СокрЛП(ТекДанные.Водитель)+"_"+СокрЛП(ТекДанные.Авто));
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТТНПоПР(Команда)
	
	ВыбранныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	Массив = Новый Массив;
	Для Каждого Эл Из ВыбранныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(Эл);
		Если Не ТекДанные = Неопределено Тогда
			Массив.Добавить(ТекДанные.ПунктРазгрузки);                    
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(Массив);
	
	Если Массив.Количество() Тогда
		ТабДок = ПечатьТТТННаСервере(,, Массив);
		ТабДок.Показать("РН_"+СокрЛП(ТекДанные.Водитель)+"_"+СокрЛП(ТекДанные.Авто));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьТТТННаСервере(Водитель = Неопределено, Авто = Неопределено, ПунктРазгрузки = Неопределено)
	
	МассивОбъектов = ПолучитьРНПоЗаявке(Водитель, Авто, ПунктРазгрузки);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КомлпектВодителю";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ПараметрыПечати = ПодготовитьПараметрыПечати(Новый Структура("ОбъектыПечати,Форма,Идентификатор", МассивОбъектов, Неопределено, Новый УникальныйИдентификатор));
	
	ТабличныйДокумент = Обработки.ПечатьТТН.ПечатьНесколькихТТН(ПараметрыПечати, Новый СписокЗначений, МассивОбъектов);
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьПараметрыПечати(ОписаниеКоманды)
	
	ПараметрКоманды    = ОписаниеКоманды.ОбъектыПечати;
	ВладелецФормы      = ОписаниеКоманды.Форма;
	
	// Проверим количество объектов, допустима печать только одного документа
	Если ТипЗнч(ПараметрКоманды) <> Тип("Массив") ИЛИ ПараметрКоманды.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получим ключ уникальности открываемой формы
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	Счетчик = 0;

	ПараметрыПечати = Новый Структура;
	Для каждого Элемент из ПараметрКоманды цикл
		ПараметрыОткрытия = Новый Структура("Документ", ПараметрКоманды[Счетчик]);
		ПараметрыОткрытия.Вставить("Идентификатор", ОписаниеКоманды.Идентификатор);
		//ФормаТТН = ПолучитьФорму("Обработка.ПечатьТТН.Форма.Форма", ПараметрыОткрытия, ВладелецФормы);
		
		стрСчетчик = Формат(Счетчик, "ЧГ=");
		  
		ПараметрыПечати.Вставить("Документ"+стрСчетчик, Элемент);
		ПараметрыПечати.Вставить("МаркаИГосНомерАвтомобиля"+стрСчетчик, Элемент.Авто);
		ПараметрыПечати.Вставить("ГосНомерПрицепа"+стрСчетчик, Элемент.Прицеп);
		ПараметрыПечати.Вставить("ПунктПогрузки"+стрСчетчик, Элемент.ерпсПунктПогрузки);
		ПараметрыПечати.Вставить("ПунктРазгрузки"+стрСчетчик,Элемент.ПунктРазгрузки);
		ПараметрыПечати.Вставить("Водитель"+стрСчетчик, СокрЛП(Элемент.Водитель));
		ПараметрыПечати.Вставить("Перевозчик"+стрСчетчик, Элемент.ЕРПСПеревозчик);
		ПараметрыПечати.Вставить("ВидПеревозки"+стрСчетчик, "за кілометровим тарифом");
		ПараметрыПечати.Вставить("ЗаголовокФормы"+стрСчетчик,Элемент);
		ПараметрыПечати.Вставить("НомерТТН"+стрСчетчик, "Р"+ ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Элемент.Номер));
		ПараметрыПечати.Вставить("ТипЦен"+стрСчетчик, Элемент.ТипЦен);
		ПараметрыПечати.Вставить("УпрощеннаяТТН"+стрСчетчик, Истина);
		ПараметрыПечати.Вставить("ПечатьНескольких", "ПечатьНескольких"); 
		ПараметрыПечати.Вставить("УпрощеннаяТТН", Истина);

		Счетчик = Счетчик + 1;
	КонецЦикла;

	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Функция ПечатьРННаСервере(Водитель = Неопределено, Авто = Неопределено, ПунктРазгрузки = Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КомлпектВодителю";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	МассивРН = ПолучитьРНПоЗаявке(Водитель, Авто, ПунктРазгрузки);
	
	
	Для Каждого Эл Из МассивРН Цикл
		ТабДок = Документы.РеализацияТоваровУслуг.ПечатьДокументаБезЦен(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Эл),
			Новый СписокЗначений,
			УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода()
		);
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДок.АвтоМасштаб = Истина;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		//Если ТабличныйДокумент.ПроверитьВывод(ТабДок) Тогда
			ТабличныйДокумент.Вывести(ТабДок);
		//Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ТабДок);
		//КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьРНПоЗаявке(Водитель = Неопределено, Авто = Неопределено, ПунктРазгрузки = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РН.Ссылка КАК РН,
	               |	Акт.Ссылка КАК Акт,
	               |	Заявка.Ссылка КАК Заявка,
	               |	РН.ПунктРазгрузки КАК ПунктРазгрузки
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ерпсАктПриемкиПередачиТоваров КАК Акт
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи КАК Заявка
	               |			ПО Акт.ЗаявкаНаСозданиеАктовПриемкиПередачи = Заявка.Ссылка
	               |		ПО РН.ерпсАктПриемкиПередачи = Акт.Ссылка
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка
	               |	И РН.Проведен
	               |	И РН.Водитель = &Водитель
	               |	И РН.ПунктРазгрузки В(&ПунктРазгрузки)
	               |	И РН.Авто = &Авто";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Если Не ЗначениеЗаполнено(Водитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РН.Водитель = &Водитель", "");
	Иначе
		Запрос.УстановитьПараметр("Водитель", Водитель);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Авто) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РН.Авто = &Авто", "");
	Иначе
		Запрос.УстановитьПараметр("Авто", Авто);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПунктРазгрузки) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РН.ПунктРазгрузки В(&ПунктРазгрузки)", "");
	Иначе
		Запрос.УстановитьПараметр("ПунктРазгрузки", ПунктРазгрузки);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РН");
	
КонецФункции

&НаКлиенте
Процедура ПечатьЗаказНаСборку(Команда)
	
	ВыбранныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	Массив = Новый Массив;
	МассивВ = Новый Массив;
	МассивА = Новый Массив;
	Для Каждого Эл Из ВыбранныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(Эл);
		Если Не ТекДанные = Неопределено Тогда
			Массив.Добавить(ТекДанные.ПунктРазгрузки);                    
			МассивВ.Добавить(ТекДанные.Водитель);
			МассивА.Добавить(ТекДанные.Авто);
		КонецЕсли;
	КонецЦикла;
	
	Если Массив.Количество() Тогда
		ТабДок = ПечатьЗаявкуНаСборкуНаСервере(Массив, МассивВ, МассивА);
		ТабДок.Показать("Заказ на сборку");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявка(Команда)
	
	ВыбранныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	Массив = Новый Массив;
	Для Каждого Эл Из ВыбранныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(Эл);
		Если Не ТекДанные = Неопределено Тогда
			Массив.Добавить(Новый Структура("ПунктРазгрузки, Водитель", ТекДанные.ПунктРазгрузки, ТекДанные.Водитель));                    
		КонецЕсли;
	КонецЦикла;
	
	Если Массив.Количество() Тогда
		ТабДок = ПечатьЗаявкуНаСервере(Массив);
		ТабДок.Показать("Заявка по пунктам розвантаження");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявки(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаСозданиеЗаявкиЗавершение", ЭтотОбъект),
		НСтр("ru = 'Создать заявку на основании текущей с распределением по датам вывоза?'; uk = 'Створити заявку на підставі поточної з розподіленням по датах вивозу?'"),
		РежимДиалогаВопрос.ДаНет,
		,
		КодВозвратаДиалога.Да,
		,
	);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВНовуюЗаявку(Команда)

	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Збережіть документ, операція не виконана",,,,);
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаВыделениеЗаявкиЗавершение", ЭтотОбъект),
			НСтр("ru = 'Выделить выбранные строки в отдельные заявки?'; uk = 'Виділити обрані строки в окремі заявки?'"),
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Да,
			,
		);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПунктыРазгрузкиПередУдалением(Элемент, Отказ)
	
	//ТекДанные = Элементы.ПунктыРазгрузки.ТекущиеДанные;
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Збережіть документ, видалення не виконано",,,, Отказ);
	Иначе
		Для Каждого ТекСтрока Из Элементы.ПунктыРазгрузки.ВыделенныеСтроки Цикл
			ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(ТекСтрока);
			ТЧТоварыУдалитьНаСервере(ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки, ТекДанные.Идентификатор);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПунктыРазгрузкиДатаОтгрузкиПриИзменении(Элемент)

	ТекДанные = Элементы.ПунктыРазгрузки.ТекущиеДанные;
	ТЧТоварыИзменитьДатуОтгрузки(ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки);	

КонецПроцедуры

&НаКлиенте
Процедура ПунктыРазгрузкиПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элементы.ПунктыРазгрузки.ТекущиеДанные;
	ДатаВывозаДоИзменения = ТекДанные.ДатаОтгрузки;
	ПунктРазгрузкиДоИзменения = ТекДанные.ПунктРазгрузки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект)
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти    //СлужебныеПроцедурыИФункцииБСП

#Область СлужебныеПроцедурыИФункции
&НаКлиенте 
Процедура ПослеЗакрытияВопросаВыделениеЗаявкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		МассивУдаляемыхСтрок = Новый Массив;
		Результат = СоздатьЗаявкуНаСервере();
		Для Каждого ТекСтрока Из Элементы.ПунктыРазгрузки.ВыделенныеСтроки Цикл
			
			//Результат = СоздатьЗаявкуНаСервере(ТекСтрока);
			Если ЗначениеЗаполнено(Результат) Тогда 
				ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(ТекСтрока);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Створено документ: "+ СокрЛП(Результат), Результат,,,);
				ТЧТоварыУдалитьНаСервере(ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки, ТекДанные.Идентификатор);
				МассивУдаляемыхСтрок.Добавить(ТекСтрока);
				//Объект.ПунктыРазгрузки.Удалить(ТекСтрока);
				Модифицированность = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		ТоварыКоличествоПриИзмененииНаСервере();
		//УдалитьСтрокуПунктаНаСервере(МассивУдаляемыхСтрок);
		
	КонецЕсли;

КонецПроцедуры

//&НаСервере
//Процедура УдалитьСтрокуПунктаНаСервере(МассивУдаляемыхСтрок)
//	
//	Т = Новый ТаблицаЗначений;
//	Т.Колонки.Добавить("Номер");
//	Для Каждого Эл Из МассивУдаляемыхСтрок Цикл
//		НоваяСтрока = Т.Добавить();
//		НоваяСтрока.Номер = Эл;
//	КонецЦикла;
//	
//	Т.Сортировать("Номер Убыв");
//	
//	Для Каждого Стр Из Т Цикл
//		Объект.ПунктыРазгрузки.Удалить(Стр);
//	КонецЦикла;
//	
//КонецПроцедуры
	
	
&НаКлиенте 
Процедура ПослеЗакрытияВопросаСозданиеЗаявкиЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Успешно = Ложь;
		СоздатьЗаявкиНаСервере(Успешно);
		ПоказатьОповещениеПользователя("Завершено",,, ?(Успешно, БиблиотекаКартинок.Успешно32, БиблиотекаКартинок.Ошибка32));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьЗаявкуНаСервере()
	//ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(ТекСтрока);
	//Если ТекДанные = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	Об = Документы.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(Об, Объект,, "Ответственный,Номер,Комментарий,Регион,ДокументОснования");
	
	Для Каждого ТекСтрока Из Элементы.ПунктыРазгрузки.ВыделенныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(ТекСтрока);
	
		ЗаполнитьЗначенияСвойств(Об.ПунктыРазгрузки.Добавить(), ТекДанные);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Таб", Объект.Товары.Выгрузить());
		Запрос.УстановитьПараметр("ПунктРазгрузки", ТекДанные.ПунктРазгрузки);
		Запрос.УстановитьПараметр("ДатаОтгрузки", ТекДанные.ДатаОтгрузки);
		Запрос.УстановитьПараметр("Идентификатор", ТекДанные.Идентификатор);
		Запрос.Текст = "ВЫБРАТЬ 
		|	Таб.* 
		|ПОМЕСТИТЬ ВТТаб
		|ИЗ &Таб КАК Таб
		|;
		|ВЫБРАТЬ  
		|	Т.*, ТТ.Номенклатура 
		|ИЗ ВТТаб КАК Т
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТТаб КАК ТТ
		|ПО ТТ.НомерСтроки = Т.НомерСтроки
		|	И ТТ.ПунктРазгрузки = &ПунктРазгрузки
		|	И ТТ.ДатаОтгрузки = &ДатаОтгрузки
		|	И ТТ.Идентификатор = &Идентификатор
		|ГДЕ
		|	НЕ ТТ.Номенклатура is null	
		|"; 
		
		Т = Запрос.Выполнить().Выгрузить();
		ТДок = Об.Товары.Выгрузить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Т, ТДок);
		
		Об.Товары.Загрузить(ТДок);
	КонецЦикла;
	
	Попытка
		Об.Записать(РежимЗаписиДокумента.Запись);
		Возврат Об.Ссылка;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура СоздатьЗаявкиНаСервере(Успешно)
	
	Успешно = Истина;
	МассивОбъектов = Новый Массив;
	МассивОбъектовДляЗаписи = Новый Массив;
	
	тзРодитель = Объект.ПунктыРазгрузки.Выгрузить();
	// Test{20230911
	// добавляем фильтр по складу, если склад не заполнен - нельзя использовать
	// Test}
	тзРодитель.Свернуть("ДатаОтгрузки, ПунктРазгрузки, Регион, Идентификатор");
	
	тзТовары = Объект.Товары.Выгрузить(); 
	// в товары доставляем дату откгрузки если необходимо (по идее уже не актуально так как дата подставляется на этапе первоначального заполнения документа)
	Для Каждого СтрокаТовары Из тзТовары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.ДатаОтгрузки) Тогда
			Попытка
				СтрокаТовары.ДатаОтгрузки = тзРодитель.НайтиСтроки(Новый Структура("ПунктРазгрузки", СтрокаТовары.ПунктРазгрузки))[0].ДатаОтгрузки;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	// проверяем на путую дату
	МассивСтрок = тзТовары.НайтиСтроки(Новый Структура("ДатаОтгрузки", Дата(1,1,1)));
	Если МассивСтрок.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось однозначно определить дату вывоза товара, документы созданы не будут'; uk = 'Не вдалося однозначно визначити дату вивозу товару, документи створені не будуть'"));
		Успешно = Ложь;
		Возврат;
	КонецЕсли;
	
	тзДатаПунктРегионСклад = тзРодитель.Скопировать();
	// убрал склад, так как теперь пересекаемость заявок контролируется регионом
	тзРодитель.Свернуть("ДатаОтгрузки,Регион");
	
	Для Каждого СтрокаРодитель Из тзРодитель Цикл
		Если Не ЗначениеЗаполнено(СтрокаРодитель.ДатаОтгрузки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана дата отгрузки, по данной строке документ создан не будет'; uk = 'Не вказано рядок, за даним рядком документ створено не буде'"));
			Успешно = Ложь;
			Продолжить;
		КонецЕсли;
		//Если Не ЗначениеЗаполнено(СтрокаРодитель.Склад) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен склад, по данной строке документ создан не будет'; uk = 'Не вказано склад, за даним рядком документ створено не буде'"));
		//	Успешно = Ложь;
		//	Продолжить;
		//КонецЕсли;		
		
		// Test{20230904
		// Поиск документа и дополнение данных в конец
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Док.Ссылка КАК Ссылка,
		               |	Док.Дата КАК Дата,
					   |	Док.Регион КАК Регион
		               //|	,ПР.Склад КАК Склад
		               |ИЗ
		               |	Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи КАК Док
					   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.ПунктыРазгрузки КАК ПР
					   //|		ПО Док.Ссылка = ПР.Ссылка
					   //|			И (ПР.Склад = &Склад)
		               |ГДЕ
		               |	НЕ Док.ПометкаУдаления
		               |	И НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		               |	И Док.Регион = &Регион
		               |	И Док.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Дата", СтрокаРодитель.ДатаОтгрузки);
	//	Запрос.УстановитьПараметр("Склад", СтрокаРодитель.Склад);
		Запрос.УстановитьПараметр("Регион", СтрокаРодитель.Регион);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

		Об = Неопределено;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокСсылка = Выборка.Ссылка;
			Об = ДокСсылка.ПолучитьОбъект();
		Иначе
			Об = Документы.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.СоздатьДокумент();
		КонецЕсли;	
		// Test}
		ЗаполнитьЗначенияСвойств(Об, Объект,, "Ответственный,Дата,Номер,Комментарий,Регион");
		Об.ДокументОснования = Объект.Ссылка;
		Об.Дата = СтрокаРодитель.ДатаОтгрузки;
		Об.Регион = СтрокаРодитель.Регион;

		// копируем товары для текущего региона + даты в новыы документ
		Для Каждого Стр Из тзДатаПунктРегионСклад.НайтиСтроки(Новый Структура("ДатаОтгрузки,Регион", СтрокаРодитель.ДатаОтгрузки, СтрокаРодитель.Регион)) Цикл
			Т0 = тзТовары.Скопировать(
				тзТовары.НайтиСтроки(
					Новый Структура("ДатаОтгрузки,ПунктРазгрузки,Идентификатор", СтрокаРодитель.ДатаОтгрузки, Стр.ПунктРазгрузки, Стр.Идентификатор)
				)
			);
			ТекИдентификатор = "ДопКол"+СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
			Для Каждого С Из Т0 Цикл
				НоваяСтрока = Об.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, С);
				НоваяСтрока.Идентификатор = ТекИдентификатор; 
			КонецЦикла; 
			
			// дополняем тч пункты разгрузки
			тз = Объект.ПунктыРазгрузки.Выгрузить();

			Т1 = тз.Скопировать(
				тз.НайтиСтроки(
					Новый Структура("ДатаОтгрузки,ПунктРазгрузки,Идентификатор", СтрокаРодитель.ДатаОтгрузки, Стр.ПунктРазгрузки, Стр.Идентификатор)
				)
			);
			Для Каждого С Из Т1 Цикл
				МассивСтрок = Об.ПунктыРазгрузки.НайтиСтроки(Новый Структура("ДатаОтгрузки,ПунктРазгрузки,Идентификатор", СтрокаРодитель.ДатаОтгрузки, Стр.ПунктРазгрузки, Стр.Идентификатор));
				Если МассивСтрок.Количество() Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = Об.ПунктыРазгрузки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, С);
				НоваяСтрока.Идентификатор = ТекИдентификатор;
			КонецЦикла; 
			
			ТоварыПересчетКоличества(Об);
	
		КонецЦикла;
			
		// 
		// Test}
		
		//
		МассивОбъектовДляЗаписи.Добавить(Об);
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Об.Ссылка);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Документ %1 заблокирован", Об.Ссылка));
			МассивОбъектов.Добавить(Об);
		КонецПопытки;		

	КонецЦикла;
	
	Если МассивОбъектов.Количество() = 0 Тогда
		Для Каждого Об Из МассивОбъектовДляЗаписи Цикл
			Попытка
				Об.ДополнительныеСвойства.Вставить("ПроверятьБлокировку", Истина);
				Об.Записать();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В документ %1 добавлено %2 строк товаров'; uk = 'В документ %1 додано %2 рядків товарів'"), Об.Ссылка, Т0.Количество()));
			Исключение
				Успешно = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось записать документ %1'; uk = 'Не вдалося записати документ %1'"), СтрокаРодитель.ДатаОтгрузки));	
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьЗаявкуНаСборкуНаСервере(ПукнтыРазгрузки, Водители, Авто)
	
	М = Новый Массив;
	М.Добавить(Объект.Ссылка);	
	
	Возврат Документы.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Печать_ОтчетПоЗаявкам(
		М,
		Неопределено,
		Новый Структура("ПунктыРазгрузки,Водитель, Авто", ПукнтыРазгрузки, Водители, Авто),
		"СхемаКомпоновкиДанныхЗаказНаСборку"
	);
	
КонецФункции

&НаСервере
Функция ПечатьЗаявкуНаСервере(ПукнтыРазгрузки)
	
	М = Новый Массив;
	М.Добавить(Объект.Ссылка);	
	
	Возврат Документы.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Печать_ОтчетПоЗаявкам(
		М,
		Неопределено,
		Новый Структура("ПунктыРазгрузкиАвто", ПукнтыРазгрузки),
		"ОсновнаяСхемаКомпоновкиДанных1"
	);
	
КонецФункции

&НаСервере
Функция ПечатьЗаявкиНаСервере(Водитель, Авто)
	
	М = Новый Массив;
	М.Добавить(Объект.Ссылка);
	
	Возврат Документы.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Печать_ОтчетПоЗаявкам(
		М,
		Неопределено,
		Новый Структура("Водитель,Авто", Водитель, Авто),
		"ОсновнаяСхемаКомпоновкиДанных1"
	); 	
	
КонецФункции

&НаКлиенте
Процедура УстановитьОбработаноНаСервере(ТабЧасть, ПунктРазгрузки, ДатаОтгрузки, Идентификатор, Значение)

	Если ТабЧасть = "ПунктыРазгрузки" Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Объект[ТабЧасть].НайтиСтроки(
		Новый Структура("ПунктРазгрузки,ДатаОтгрузки,Идентификатор", ПунктРазгрузки, ДатаОтгрузки, Идентификатор)
	);
	Для Каждого Стр Из МассивСтрок Цикл
		Стр.Обработано = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораНастройкиЗагрузки(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("НастройкиЗагрузки", НастройкиИмпорта(Результат));
	
	ВыбратьФайлыДляИмпортаДанных(СтруктураПараметров);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиИмпорта(Настройка)
	
	Вернуть = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"	, Настройка);
	Запрос.Текст = "ВЫБРАТЬ *
					|ИЗ
	               	|	Справочник.а_НастройкиЗагрузкиЗаявок КАК Спр
	               	|ГДЕ
	               	|	Спр.Ссылка = &Ссылка";
	
	тзДанные = Запрос.Выполнить().Выгрузить();
	
	Если Не тзДанные.Количество() = 0 Тогда
		
		стр0 = тзДанные[0];
		
		Для Каждого Колонка из тзДанные.Колонки Цикл
			
			Вернуть.Вставить(Колонка.Имя, стр0[Колонка.Имя]);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Вернуть;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьФайлыДляИмпортаДанных(СтруктураПараметров) Экспорт
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ИмпортДанных", ЭтотОбъект, СтруктураПараметров);
	
	ПарамДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПарамДиалога.МножественныйВыбор 	= Истина;
	ПарамДиалога.Заголовок 			= НСтр("ru = 'Выберите файлы'; uk = 'Оберіть файли'");
	
	Если СтруктураПараметров.НастройкиЗагрузки.ТипФайла = ПредопределенноеЗначение("Перечисление.а_ТипыФайловЗагрузки.Excel") Тогда
		ПарамДиалога.Фильтр			 	= "EXCEL|*.xlsx;*.xls";
	Иначе
		ПарамДиалога.Фильтр			 	= "CSV|*.csv";
	КонецЕсли;
	
	НачатьПомещениеФайловНаСервер(ОповещениеВыбора,,, ПарамДиалога, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортДанных(ПомещенныеФайлы, СтруктураПараметров) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Состояние(НСтр("ru = 'Данные загружаются...'; uk = 'Триває загрузка даних...'"));
	
	ПереданныеФайлы = Новый Массив;

	Для Каждого ПомещенныйФайл из ПомещенныеФайлы Цикл
		
		Если ПомещенныйФайл.ПомещениеФайлаОтменено Тогда
			Продолжить;
		КонецЕсли;
		
		структФайла = Новый Структура("Адрес,Имя,Расширение"
							, ПомещенныйФайл.Адрес
							, ПомещенныйФайл.СсылкаНаФайл.Имя
							, ПомещенныйФайл.СсылкаНаФайл.Расширение
		);
		
		ПереданныеФайлы.Добавить(структФайла);
		
	КонецЦикла;
	
	ИмпортДанныхНаСервере(ПереданныеФайлы, СтруктураПараметров);

	
КонецПроцедуры

&НаСервере
Процедура ИмпортДанныхНаСервере(ПереданныеФайлы, СтруктураПараметров)
	
	ВыбЗначение = "";
	
	Если ПереданныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТабРезультат = Объект.Товары.Выгрузить().СкопироватьКолонки();
	
	Для Каждого текПереданныйФайл Из ПереданныеФайлы Цикл
		
		ФайлИзХранилища = ПолучитьИзВременногоХранилища(текПереданныйФайл.Адрес);
		Файл = ПолучитьИмяВременногоФайла(текПереданныйФайл.Расширение);
		ФайлИзХранилища.Записать(Файл);
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(Файл);
		
		КодСтроки = 0;
		Для НомСтроки = СтруктураПараметров.НастройкиЗагрузки.ПерваяСтрока По ТабДок.ВысотаТаблицы Цикл
			Если СтруктураПараметров.НастройкиЗагрузки.КолонкаКоличество <> 0 Тогда
				// реализовать
				
			Иначе
				Если СтруктураПараметров.НастройкиЗагрузки.КолонкаПунктРазгрузки = 0 И СтруктураПараметров.НастройкиЗагрузки.СтрокаПунктРазгрузки = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не верно указаны колонки загрузки для полей количество или пункт разгрузки'; uk = 'Не вірно вказано колонки завантаження для полів кількість або пунк розвантаження'"));
					Возврат;
				КонецЕсли;
				
				Для НомКолонки = СтруктураПараметров.НастройкиЗагрузки.КолонкаПунктРазгрузки По ТабДок.ШиринаТаблицы Цикл
					//сПунктРасгрузки = Новый Соответствие;
					//сПунктРасгрузки.Вставить(Справочники.ПунктыРазгрузки.НайтиПоНаименованию(СокрЛП(ТабДок.Область(СтруктураПараметров.НастройкиЗагрузки.СтрокаПунктРазгрузки, СтруктураПараметров.НастройкиЗагрузки.КолонкаПунктРазгрузки, СтруктураПараметров.НастройкиЗагрузки.СтрокаПунктРазгрузки, СтруктураПараметров.НастройкиЗагрузки.КолонкаПунктРазгрузки).Текст))
					//);
					
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбновленияТаблицыПунктыРазгрузки(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбновитьПунктыРазгрузкиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПунктыРазгрузкиНаСервере()
	Если Не Объект.ПунктыРазгрузки.Количество() Тогда
		тзНомен = Объект.Товары.Выгрузить();
		тзНомен.Свернуть("ПунктРазгрузки,Идентификатор,ДатаОтгрузки,Обработано", "Количество");
		
		Объект.ПунктыРазгрузки.Загрузить(тзНомен);
		ЗаполнитьЗначенияПунктыРазгрузкиПоУмолчанию(Объект);
		ЗаполнитьКонтактнымиДанными(, Объект);
		ОбновитьИнфоПоВодителям();
	Иначе
		ТоварыКоличествоПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбновитьДатуВывозаФакт();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнфоПоВодителям()
	тз = Объект.ПунктыРазгрузки.Выгрузить();
	тз.Свернуть("Водитель,Авто", "Количество");
	
	ИтогиПоВодителям.Загрузить(тз);
КонецПроцедуры

&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере()
	
  	ТоварыПересчетКоличества(Объект);
	
	ЗаполнитьЗначенияПунктыРазгрузкиПоУмолчанию(Объект);
	ЗаполнитьКонтактнымиДанными(, Объект);
	ЗаполнитьДаннымиСотрудника(, Объект);
	ОбновитьИнфоПоВодителям();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыПересчетКоличества(Об)
	
	тзТоварыПункты = Об.Товары.Выгрузить();
	тзТоварыПункты.Свернуть("ПунктРазгрузки,ДатаОтгрузки,Идентификатор");
	тзТоварыПункты.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	
	тзНомен = Об.Товары.Выгрузить();
	Для Каждого Эл Из Об.ПунктыРазгрузки Цикл
		тз = тзНомен.Скопировать(
			тзНомен.НайтиСтроки(Новый Структура("ПунктРазгрузки,Идентификатор,ДатаОтгрузки", Эл.ПунктРазгрузки, Эл.Идентификатор, Эл.ДатаОтгрузки))
		);
		Эл.Количество = тз.Итог("Количество");
		
		МассивТовары = тзТоварыПункты.НайтиСтроки(Новый Структура("ПунктРазгрузки,Идентификатор,ДатаОтгрузки", Эл.ПунктРазгрузки, Эл.Идентификатор, Эл.ДатаОтгрузки));
		Попытка
			Для Каждого ЭлТ Из МассивТовары Цикл
				ЭлТ.Пометка = Истина;
			КонецЦикла;
		Исключение
			Сообщить("Неожиданное поведение при пересчете количества в пунктах разгрузки.");
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого С Из тзТоварыПункты Цикл
		Если С.Пометка Или Не ЗначениеЗаполнено(С.ПунктРазгрузки) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Об.ПунктыРазгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, С);
		
		
		тз = тзНомен.Скопировать(
			тзНомен.НайтиСтроки(Новый Структура("ПунктРазгрузки,Идентификатор,ДатаОтгрузки", С.ПунктРазгрузки, С.Идентификатор, С.ДатаОтгрузки))
		);
		НоваяСтрока.Количество = тз.Итог("Количество"); 
		
		//ТоварыПересчетКоличества(Об);
		ЗаполнитьЗначенияПунктыРазгрузкиПоУмолчанию(Об);
		ЗаполнитьКонтактнымиДанными(, Об);
		ЗаполнитьДаннымиСотрудника(, Об);
		
	КонецЦикла;
	
	Т = Об.ПунктыРазгрузки.Выгрузить();
	Т.Колонки.Добавить("Пометка");
	Для Каждого С Из Т Цикл
		МассивСтрок = тзТоварыПункты.НайтиСтроки(Новый Структура("ПунктРазгрузки,Идентификатор,ДатаОтгрузки", С.ПунктРазгрузки, С.Идентификатор, С.ДатаОтгрузки));
		Если Не МассивСтрок.Количество() Тогда
			С.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	МассивСтрок = Т.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого Э Из МассивСтрок Цикл
		Т.Удалить(Э);
	КонецЦикла;
	Об.ПунктыРазгрузки.Загрузить(Т);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуВывоза(Знач Дата, ДеньВывоза)
	
	Если ДеньВывоза = 0 Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Если ДеньНедели(Дата) = ДеньВывоза Тогда
		Возврат Дата;
	КонецЕсли;
	
	Возврат ПолучитьДатуВывоза(КонецДня(Дата) + 1, ДеньВывоза);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьКонтактнымиДанными(НомерСтроки = Неопределено, Об)
	
	Если НомерСтроки = Неопределено Тогда
		Для Каждого ТекДанные Из Об.ПунктыРазгрузки Цикл
			Если ЗначениеЗаполнено(ТекДанные.ПунктРазгрузки) Тогда
				ТекПункт = ТекДанные.ПунктРазгрузки;
				Если ЗначениеЗаполнено(ТекДанные.КонтактноеЛицо) ИЛИ ЗначениеЗаполнено(ТекДанные.КонтактныеДанные) Тогда
				Иначе
					Попытка
						ТекДанные.КонтактноеЛицо = ТекПункт.КонтактноеЛицо;
						ТекДанные.КонтактныеДанные = ТекПункт.КонтактныеДанные; 
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не удалось подставить контрагента и договор, попробуйте записать докумнет, выйти с него и зайти заново'; uk = 'Не вдалося підставити контрагента та договір, спробуйте записати документ вийти з нього та зайти знов'"));
					КонецПопытки;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекДанные.Контрагент) Тогда
				Иначе
					Попытка
						ТекДанные.Контрагент = ТекПункт.Контрагент;
						ТекДанные.Договор = ТекПункт.ДоговорКонтрагента;
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не удалось подставить контрагента и договор, попробуйте записать докумнет, выйти с него и зайти заново'; uk = 'Не вдалося підставити контрагента та договір, спробуйте записати документ вийти з нього та зайти знов'"));
					КонецПопытки;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекДанные.ДатаОтгрузки) Тогда
				Иначе
					ТекДанные.ДатаОтгрузки = ПолучитьДатуВывоза(Об.Дата, ТекПункт.ДеньВывоза);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекПункт.Регион) Тогда
					ТекДанные.Регион = ТекПункт.Регион;
				КонецЕсли;

			КонецЕсли;
		КонецЦикла;
	Иначе
		Попытка
			ТекДанные = Об.ПунктыРазгрузки.НайтиПоИдентификатору(НомерСтроки);
		Исключение
			ТекДанныеМассив = Об.ПунктыРазгрузки.НайтиСтроки(Новый Структура("Идентификатор", НомерСтроки));
			ТекДанные = ТекДанныеМассив[0];
		КонецПопытки;
		Если ЗначениеЗаполнено(ТекДанные.ПунктРазгрузки) Тогда
			ТекПункт = ТекДанные.ПунктРазгрузки;
			Если ЗначениеЗаполнено(ТекДанные.КонтактноеЛицо) ИЛИ ЗначениеЗаполнено(ТекДанные.КонтактныеДанные) Тогда
			Иначе
				ТекДанные.КонтактноеЛицо = ТекПункт.КонтактноеЛицо;
				ТекДанные.КонтактныеДанные = ТекПункт.КонтактныеДанные;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.Контрагент) Тогда
			Иначе
				Попытка
					ТекДанные.Контрагент = ТекПункт.Контрагент;
					ТекДанные.Договор = ТекПункт.ДоговорКонтрагента;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не удалось подставить контрагента и договор, попробуйте записать докумнет, выйти с него и зайти заново'; uk = 'Не вдалося підставити контрагента та договір, спробуйте записати документ вийти з нього та зайти знов'"));
				КонецПопытки;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.ДатаОтгрузки) Тогда
			Иначе
				ТекДанные.ДатаОтгрузки = ПолучитьДатуВывоза(Об.Дата, ТекПункт.ДеньВывоза);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекПункт.Регион) Тогда
				ТекДанные.Регион = ТекПункт.Регион;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДаннымиСотрудника(НомерСтроки = Неопределено, Об, ИдентификаторСтроки = "")
	
	Если НомерСтроки = Неопределено Тогда
		Для Каждого ТекДанные Из Об.ПунктыРазгрузки Цикл
			Если ЗначениеЗаполнено(ТекДанные.Водитель) Тогда
				Если ЗначениеЗаполнено(ТекДанные.Водитель.а_Авто) Тогда
					//Если Не ЗначениеЗаполнено(ТекДанные.Авто) Тогда
						ТекДанные.Авто = ТекДанные.Водитель.а_Авто;
					//КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекДанные.Водитель.а_Прицеп) Тогда
					//Если Не ЗначениеЗаполнено(ТекДанные.Прицеп) Тогда
						ТекДанные.Прицеп = ТекДанные.Водитель.а_Прицеп;
					//КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Попытка
			ТекДанныеМассив = Об.ПунктыРазгрузки.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторСтроки));
			ТекДанные = ТекДанныеМассив[0];		
		Исключение
			ТекДанные = Об.ПунктыРазгрузки[НомерСтроки];
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ТекДанные.Водитель) Тогда
			Если ЗначениеЗаполнено(ТекДанные.Водитель.а_Авто) Тогда
				ТекДанные.Авто = ТекДанные.Водитель.а_Авто;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.Водитель.а_Прицеп) Тогда
				ТекДанные.Прицеп = ТекДанные.Водитель.а_Прицеп;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если РольДоступна("епрсРазрешитьРедактированиеЗагруженныхКолонокАкта") Тогда
		Элементы.ТоварыЗагруженноеКоличество.ТолькоПросмотр = Ложь;
		Элементы.ТоварыЗагруженнаяНоменклатура.ТолькоПросмотр = Ложь; 
		Элементы.ТоварыЗагруженныйДополнительныеАртикулы.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьПараметрыОбработкиТоварыНоменклатураПриИзменении(СтрокаТабличнойЧасти)
	
	ДанныеСтрокиТаблицы = Новый Структура(
		"Номенклатура, ЕдиницаИзмерения, ДополнительныеАртикулы 
		|");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, СтрокаТабличнойЧасти);
		
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("ДанныеСтрокиТаблицы", 	ДанныеСтрокиТаблицы);
	
	Возврат ПараметрыОбработки;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)

	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Загрузка из Excel недоступна в Web-клиенте.';uk='Завантаження Excel недоступне у Web-клієнті.'"));
	#Иначе
		//ERPS_TASK_В.Головченко_28.02.2023 - додано параметр "Организация"
		//ДопПараметры = Новый Структура("Контрагент, Организация",Неопределено,Объект.Организация);
		// ек убран параметр организация
		ДопПараметры = Новый Структура("Контрагент",Неопределено);
		ОбработкаЗакрытия = Новый ОписаниеОповещения("ЗаркытиеОбработки_ЗагрузкаИзВнешнегоФайла",ЭтотОбъект);
		
		ОткрытьФорму("Обработка.ерпсСозданиеАктаПриемаПередачиТовара.Форма.Форма",
					ДопПараметры,
					ЭтаФорма,,,,
					ОбработкаЗакрытия,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
	#КонецЕсли	

КонецПроцедуры


&НаКлиенте
Процедура ЗаркытиеОбработки_ЗагрузкаИзВнешнегоФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоказатьВопросОчиститьДалее", ЭтотОбъект, Результат),
			НСтр("ru = 'В документе уже есть данные, очистить строки?'; uk = 'В документі вже є дані, очистити рядки?'"),
			РежимДиалогаВопрос.ДаНет
		);
	Иначе
		Объект.Товары.Очистить();
		ЗагрузкаИзВнешнегоФайлаНаСервере(Результат);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОчиститьДалее(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		ЗагрузкаИзВнешнегоФайлаНаСервере(ДопПараметры);
	Иначе
		ЗагрузкаИзВнешнегоФайлаНаСервере(ДопПараметры);
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаИзВнешнегоФайлаНаСервере(АдресВременногоХранилища)
	
	ТЗНоменклатур = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
	КодСтроки = 0;
	Для каждого ТекущаяСтрока из ТЗНоменклатур Цикл
		
		НовСтр = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ТекущаяСтрока);
		НовСтр.КодСтроки = КодСтроки;
		Если Не ЗначениеЗаполнено(НовСтр.ДатаОтгрузки) Тогда
			НовСтр.ДатаОтгрузки = ПолучитьДатуВывоза(Объект.Дата, НовСтр.ПунктРазгрузки.ДеньВывоза);
			НовСтр.ДатаОтгрузки = ?(Не ЗначениеЗаполнено(НовСтр.ДатаОтгрузки),
				?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()),
				НовСтр.ДатаОтгрузки
			);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПунктыРазгрузкиНаСервере();
	
	Если Объект.Товары.Количество() Тогда
		ЗаполнитьДопДанныеТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗначенияПунктыРазгрузкиПоУмолчанию(Об)
	
	СкладПоУмолчанию = Неопределено;
	Попытка
		Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ерпсЗаявкаНаСозданиеАктовПриемкиПередачи", 
			"ЗначенияРеквизитовПоУмолчанию",
			,
			,
			Пользователи.ТекущийПользователь()
		);
		
		СкладПоУмолчанию = Настройки.Настройки;
	Исключение
	КонецПопытки;
	
	Для Каждого Эл Из Об.ПунктыРазгрузки Цикл
		Если Не ЗначениеЗаполнено(Эл.Организация) Тогда
			Эл.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Эл.Склад) И ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
			Эл.Склад = СкладПоУмолчанию;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Эл.Склад) Тогда
			Эл.Склад = Справочники.Склады.НайтиПоКоду("00-000024");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Эл.Перевозчик) Тогда
			Эл.Перевозчик = Справочники.Контрагенты.НайтиПоКоду("00-000510");
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПустоеОповещение(Р,П) Экспорт
КонецПроцедуры

&НаСервере
Функция ЕстьПустыеКонтрагенты()

	Возврат Объект.ПунктыРазгрузки.НайтиСтроки(Новый Структура("Контрагент",Справочники.Контрагенты.ПустаяСсылка())).Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросПредупреждение(ОписаниеОповещениеПослеОшибки, ТекстСообщения) 
	ПоказатьВопрос(ОписаниеОповещениеПослеОшибки,
	                    ТекстСообщения,
						РежимДиалогаВопрос.ОК,
						,
						,
						Нстр("ru='Внимание';uk='Увага'")
		);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораКонтрагентов()

	Результат = Новый СписокЗначений;
	
	ТЗКонтрагенты = Объект.ПунктыРазгрузки.Выгрузить();
	ТЗКонтрагенты.Свернуть("Контрагент");
	
	Для каждого ТекКонтрагент из ТЗКонтрагенты Цикл
		Результат.Добавить(ТекКонтрагент.Контрагент,ТекКонтрагент.Контрагент);	
	КонецЦикла;                                    
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполненияДокументаНеПройдена()

	Если Объект.ПунктыРазгрузки.Количество() = 0 тогда
		ОписаниеОповещениеПослеОшибки = Новый ОписаниеОповещения("ПустоеОповещение",ЭтотОбъект);
		ПоказатьВопросПредупреждение(ОписаниеОповещениеПослеОшибки,Нстр("ru='Сначала заполните таблицу пунктов разгрузки';uk='Спочатку заповніть таблицю пунктів розвантаження'"));
		Возврат Истина;
	КонецЕсли;
	
	Если ЕстьПустыеКонтрагенты() Тогда
		ОписаниеОповещениеПослеОшибки = Новый ОписаниеОповещения("ПустоеОповещение",ЭтотОбъект);
		ПоказатьВопросПредупреждение(ОписаниеОповещениеПослеОшибки, Нстр("ru='Сначала заполните контрагентов в таблице пунктов разгрузки';uk='Спочатку заповніть контрагентів в таблиці пунктів розвантаження'"));
		Возврат Истина;
	КонецЕсли;
	
	Если Объект.Товары.Количество() = 0 тогда
		ОписаниеОповещениеПослеОшибки = Новый ОписаниеОповещения("ПустоеОповещение",ЭтотОбъект);
		ПоказатьВопросПредупреждение(ОписаниеОповещениеПослеОшибки,Нстр("ru='Сначала заполните таблицу товаров';uk='Спочатку заповніть таблицю товарів'"));
		Возврат Истина;
	КонецЕсли;         
	
	Возврат Ложь;

КонецФункции


#КонецОбласти

#Область СозданиеАктов

&НаКлиенте
Процедура СоздатьАкты(Команда)
		
	Если ПроверкаЗаполненияДокументаНеПройдена() тогда
		Возврат;
	КонецЕсли;
	
	//СоздатьАктыНаСервере();
	//ек++
	СписокПунктовВывоза = ПолучитьСписокПунктовВывозаНаСервере();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыборСпискаПунктовРазгрузкиЗавешение", ЭтотОбъект), СписокПунктовВывоза,,);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкт(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьАктПослеВопросаЗавершение", ЭтотОбъект,), "Створити акт для обраного пункту розвантаження?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАктПослеВопросаЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекДанные = Элементы.ПунктыРазгрузки.ТекущиеДанные;
		СоздатьАктыНаСервереНовый(ТекДанные.ПунктРазгрузки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборСпискаПунктовРазгрузкиЗавешение(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		СоздатьАктыНаСервереНовый(Результат.Значение);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокПунктовВывозаНаСервере()
	
	сп = Новый СписокЗначений;
	тз = Объект.ПунктыРазгрузки.Выгрузить();
	тз.Свернуть("ПунктРазгрузки");
	сп.ЗагрузитьЗначения(тз.ВыгрузитьКолонку("ПунктРазгрузки"));
	
	сп.Добавить("ВСЕ", НСтр("ru = 'ВСЕ'; uk = 'ВСІ'"));
	
	Возврат сп;
	
КонецФункции

&НаСервере
Процедура СоздатьАктыНаСервереНовый(Выб)
	
	Для каждого Пункт из ОБъект.ПунктыРазгрузки Цикл
		
		Если ТипЗнч(Выб) = Тип("СправочникСсылка.ПунктыРазгрузки") Тогда
			Если Не Пункт.ПунктРазгрузки = Выб Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если АктУжеСозданРаннее(Пункт.Контрагент,Пункт.ПунктРазгрузки,Объект.Ссылка) тогда
			Продолжить;
		КонецЕсли;
		
		НовДок = Документы.ерпсАктПриемкиПередачиТоваров.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовДок,Объект,,"Номер");
		
		НовДок.ЗаявкаНаСозданиеАктовПриемкиПередачи = ОБъект.Ссылка;
		НовДок.Контрагент 		= Пункт.Контрагент;
		НовДок.Договор 			= Пункт.Договор;
		НовДок.Ответственный	= Пользователи.ТекущийПользователь();
		НовДок.ПунктРазгрузки	= Пункт.ПунктРазгрузки;
		НовДок.Дата 			= ?(ЗначениеЗаполнено(Пункт.ДатаОтгрузки),Пункт.ДатаОтгрузки,ТекущаяДата());
		//ек++
		//НовДок.Склад			= Объект.Склад;
		НовДок.Организация		= Пункт.Организация;
		НовДок.Склад			= Пункт.Склад;
		НовДок.ПериодОтгрузки	= Объект.ПериодОтгрузки;
		НовДок.Перевозчик		= Пункт.Перевозчик;
		
		ЗаполнитьЗначенияСвойств(НовДок, Пункт, "Водитель,Авто,Прицеп");
		
		СтрокиКПереносу = Объект.Товары.НайтиСтроки(Новый Структура("ПунктРазгрузки",Пункт.ПунктРазгрузки));
		//НовДок.Товары.Загрузить(Объект.Товары.Выгрузить(СтрокиКПереносу));
		тзЗагрузки = Объект.Товары.Выгрузить(СтрокиКПереносу);
		тзЗагрузки.Сортировать("Номенклатура");
		Для Каждого СтрТЗ Из тзЗагрузки Цикл
			Если СтрТЗ.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовДок.Товары.Добавить(), СтрТЗ); 
		КонецЦикла;
		
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере
Процедура СоздатьАктыНаСервере()
	Для каждого Пункт из ОБъект.ПунктыРазгрузки Цикл
		
		Если АктУжеСозданРаннее(Пункт.Контрагент,Пункт.ПунктРазгрузки,Объект.Ссылка) тогда
			Продолжить;
		КонецЕсли;
		
		НовДок = Документы.ерпсАктПриемкиПередачиТоваров.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовДок,Объект,,"Номер");
		
		НовДок.ЗаявкаНаСозданиеАктовПриемкиПередачи = ОБъект.Ссылка;
		НовДок.Контрагент 		= Пункт.Контрагент;
		НовДок.Договор 			= Пункт.Договор;
		НовДок.Ответственный	= Пользователи.ТекущийПользователь();
		НовДок.ПунктРазгрузки	= Пункт.ПунктРазгрузки;
		НовДок.Дата 			= ТекущаяДата(); 
		НовДок.Склад			= Объект.Склад;
		
		СтрокиКПереносу = Объект.Товары.НайтиСтроки(Новый Структура("ПунктРазгрузки",Пункт.ПунктРазгрузки));
		НовДок.Товары.Загрузить(Объект.Товары.Выгрузить(СтрокиКПереносу));
		
		НовДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция АктУжеСозданРаннее(Контрагент,ПунктРазгрузки,ДокументСсылка, Организация = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ерпсАктПриемкиПередачиТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ерпсАктПриемкиПередачиТоваров КАК ерпсАктПриемкиПередачиТоваров
		|ГДЕ
		|	НЕ ерпсАктПриемкиПередачиТоваров.ПометкаУдаления
		|	И ерпсАктПриемкиПередачиТоваров.ПунктРазгрузки = &ПунктРазгрузки
		|	И ерпсАктПриемкиПередачиТоваров.Контрагент = &Контрагент
		|	И ерпсАктПриемкиПередачиТоваров.ЗаявкаНаСозданиеАктовПриемкиПередачи = &ЗаявкаНаСозданиеАктовПриемкиПередачи";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПунктРазгрузки", ПунктРазгрузки);
	Запрос.УстановитьПараметр("ЗаявкаНаСозданиеАктовПриемкиПередачи",ДокументСсылка);
	Если Не Организация = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "	И ерпсАктПриемкиПередачиТоваров.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура Утвердить(Команда)
	Объект.Утвержден = Не Объект.Утвержден;
	Элементы.Утвердить.Пометка = Объект.Утвержден;
	Элементы.ГруппаДатаНомер.ЦветФона = ?(Объект.Утвержден, WebЦвета.БледноЗеленый, WebЦвета.Белый);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Попытка
		Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ерпсЗаявкаНаСозданиеАктовПриемкиПередачи", 
			"ЗначенияРеквизитовПоУмолчанию",
			,
			,
			Пользователи.ТекущийПользователь()
		);
		
		Если Не Настройки = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияПоУмолчаниюНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ерпсЗаявкаНаСозданиеАктовПриемкиПередачи", 
		"ЗначенияРеквизитовПоУмолчанию",
		Новый Структура("СкладПоУмолчанию", СкладПоУмолчанию),
		,
		Пользователи.ТекущийПользователь()
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗначенияПоУмолчанию(Команда)
	ОткрытьФорму("Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Форма.ФормаУстановкиРеквизитовПоУмолчанию",
		Новый Структура("СкладПоУмолчанию", СкладПоУмолчанию),
		ЭтаФорма, УникальныйИдентификатор,
		,
		,
		Новый ОписаниеОповещения("УстановкаРеквизитовПоУмолчаниюДалее", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);  
КонецПроцедуры

&НаКлиенте
Процедура УстановкаРеквизитовПоУмолчаниюДалее(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);
	СохранитьЗначенияПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПунктыРазгрузкиПриИзменении(Элемент)
	ОбновитьИнфоПоВодителям();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ТоварыКоличествоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьИнфоПоВодителям();
	
	Если ЗначениеЗаполнено(Объект.ДокументОснования) Тогда
		ДокументОснованиеНадпись = СтрШаблон("Документ підстава: %1", Объект.ДокументОснования);
	КонецЕсли;
	
	Если Объект.Товары.Количество() Тогда
		ЗаполнитьДопДанныеТоваров();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Объект.ДокументОснования);
КонецПроцедуры

// Test{20230830
//колокнка в которой сумма всех заказанных "Апельсинов" на дату документа и исключать основной документ
&НаСервере
Процедура ЗаполнитьДопДанныеТоваров()
	
	тз = Объект.Товары.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таб", тз);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.Текст = "ВЫБРАТЬ * 
	|ПОМЕСТИТЬ ВТТаб
	|ИЗ &Таб КАК Т
	|;
	|ВЫБРАТЬ 
	|	Т.КодСтроки,
	|	Т.Номенклатура,
	|	Т.ДополнительныеАртикулы,
	|	Т.ЕдиницаИзмерения,
	|	Т.Количество,
	|	Т.Примечание,
	|	Т.ПунктРазгрузки,
	|	Т.Идентификатор,
	|	Т.ДатаОтгрузки,
	|	Т.ЗагруженнаяНоменклатура,
	|	Т.ЗагруженноеКоличество,
	|	Т.ЗагруженныйДополнительныеАртикулы,
	|	Т.Обработано,
	|	ТТ.Кво КАК ЗаказаноВЭтотДень
	|ИЗ ВТТаб КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ТЧ.Номенклатура,
	|		ТЧ.ДатаОтгрузки,
	|		СУММА(ТЧ.Количество) КАК Кво 
	|	ИЗ
	|		Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Товары КАК ТЧ
	|	ГДЕ 
	|		НЕ ТЧ.Ссылка.ПометкаУдаления
	|       И ТЧ.ДатаОтгрузки = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|       И НЕ ТЧ.Ссылка.ДокументОснования = НЕОПРЕДЕЛЕНО
	|	СГРУППИРОВАТЬ ПО
	|		ТЧ.Номенклатура,
	|		ТЧ.ДатаОтгрузки) КАК ТТ
	|ПО ТТ.Номенклатура = Т.Номенклатура
	|	И ТТ.ДатаОтгрузки = Т.ДатаОтгрузки";
	
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
// Test}

// Test{20230904
&НаСервере
Процедура ТЧТоварыУдалитьНаСервере(ПунктРазгрузки, Дата, Идентификатор)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Сообщить("Нельзя удалять пунк разгрузки с путой датой");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таб", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ПунктРазгрузки", ПунктРазгрузки);
	Запрос.УстановитьПараметр("ДатаОтгрузки", Дата);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.Текст = "ВЫБРАТЬ 
	|	Таб.* 
	|ПОМЕСТИТЬ ВТТаб
	|ИЗ &Таб КАК Таб
	|;
	|ВЫБРАТЬ  
	|	Т.*, ТТ.Номенклатура 
	|ИЗ ВТТаб КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТТаб КАК ТТ
	|ПО ТТ.НомерСтроки = Т.НомерСтроки
	|	И ТТ.ПунктРазгрузки = &ПунктРазгрузки
	|	И ТТ.ДатаОтгрузки = &ДатаОтгрузки
	|	И ТТ.Идентификатор = &Идентификатор
	|ГДЕ
	|	ТТ.Номенклатура is null	
	|";
	тз = Запрос.Выполнить().Выгрузить();
	
	Объект.Товары.Загрузить(тз);
	
КонецПроцедуры

&НаСервере
Процедура ТЧТоварыИзменитьДатуОтгрузки(ПунктРазгрузки, Дата)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таб", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаВывозаДоИзменения);
	Запрос.УстановитьПараметр("ПунктРазгрузки", ПунктРазгрузки);
	Запрос.УстановитьПараметр("НоваяДатаОтгрузки", Дата);
	Запрос.Текст = "ВЫБРАТЬ 
	|	Таб.* 
	|ПОМЕСТИТЬ ВТТаб
	|ИЗ &Таб КАК Таб
	|;
	|ВЫБРАТЬ  
	|	ВЫБОР КОГДА Т.ПунктРазгрузки = &ПунктРазгрузки И Т.ДатаОтгрузки = &ДатаОтгрузки ТОГДА
	|  		&НоваяДатаОтгрузки
	|	ИНАЧЕ Т.ДатаОтгрузки КОНЕЦ КАК ДатаОтгрузки,
	|	ВЫБОР КОГДА Т.ПунктРазгрузки = &ПунктРазгрузки И Т.ДатаОтгрузки = &ДатаОтгрузки ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК БылиИзменения,
	|	Т.* 
	|ИЗ ВТТаб КАК Т
	|";
	тз = Запрос.Выполнить().Выгрузить();
	Если тз.Найти(Истина, "БылиИзменения") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаОтгрузки", "ДАТАВРЕМЯ(1,1,1)");
		тз = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если тз.Найти(Истина, "БылиИзменения") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Т.ДатаОтгрузки = &ДатаОтгрузки", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Т.ДатаОтгрузки = ДАТАВРЕМЯ(1,1,1)", "");
		тз = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Объект.Товары.Загрузить(тз);
	
КонецПроцедуры 

&НаСервере
Процедура ТЧТоварыИзменитьПунктОтгрузки(ПунктРазгрузки, Дата, Идентификатор)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таб", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ДатаОтгрузки", Дата);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ПунктРазгрузки", ПунктРазгрузкиДоИзменения);
	Запрос.УстановитьПараметр("НовыйПунктРазгрузки", ПунктРазгрузки);
	Запрос.Текст = "ВЫБРАТЬ 
	|	Таб.* 
	|ПОМЕСТИТЬ ВТТаб
	|ИЗ &Таб КАК Таб
	|;
	|ВЫБРАТЬ  
	|	ВЫБОР КОГДА Т.ПунктРазгрузки = &ПунктРазгрузки И Т.ДатаОтгрузки = &ДатаОтгрузки И Т.Идентификатор = &Идентификатор ТОГДА
	|  		&НовыйПунктРазгрузки
	|	ИНАЧЕ Т.ПунктРазгрузки КОНЕЦ КАК ПунктРазгрузки,
	|	ВЫБОР КОГДА Т.ПунктРазгрузки = &ПунктРазгрузки И Т.ДатаОтгрузки = &ДатаОтгрузки  И Т.Идентификатор = &Идентификатор ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК БылиИзменения,
	|	Т.* 
	|ИЗ ВТТаб КАК Т
	|";
	тз = Запрос.Выполнить().Выгрузить();
	
	Объект.Товары.Загрузить(тз);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыАдресДоставкиПриИзменении(Элемент)
	ТоварыКоличествоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ)
	тз = Объект.ПунктыРазгрузки.Выгрузить();
	тз.Свернуть("Склад");
	сч = 0;
	Для Каждого С Из тз Цикл
		Если ЗначениеЗаполнено(С.Склад) Тогда
			сч = сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если сч > 1 Тогда
		Отказ = Истина;
		ВызватьИсключение("Неможна в таблічній частині Пункти розвантаження обирати різні Склади для одного документу");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНоменклатуруНасервере(Отказ)

	Если Не Константы.а_ПроверятьЗаполненностьНоменклатуры.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.Номенклатура КАК Номенклатура,
	               |	Таб.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТТаб
	               |ИЗ
	               |	&Таб КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаб.Номенклатура КАК Номенклатура,
	               |	ВТТаб.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТТаб КАК ВТТаб
				   |ГДЕ
				   |	ВТТаб.Номенклатура.а_Номенклатура = ЗНАЧЕНИЕ(Справочник.а_Номенклатура.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Таб", Объект.Товары.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'В строке %1 у номенклатуры %2 не заполнено поле номенклатуры. Взможно стоит выбрать другую номенклатуру'; uk = 'У рядку %1 у номенклатури %2 не заповнено поле номентклатури. Можливо треба обрати іншу номенклатуру'"),
				Выборка.НомерСтроки, 
				Выборка.Номенклатура
			),
			,
			"Товары["+Формат(Выборка.НомерСтроки-1,"ЧГ=")+"].Номенклатура",
			"Объект",
			Отказ
		);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ);
	ПроверитьНоменклатуруНасервере(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВодителя(Команда)
	Сп = ПолучитьСписокЗначенийВодителей();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеЗакрытияВыбораИзСпискаВодителей", ЭтотОбъект),
		Сп,
		Элементы.ПунктыРазгрузкиВодитель,
		Сп.НайтиПоЗначению(Элементы.ПунктыРазгрузки.ТекущиеДанные.Водитель)
	);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийВодителей()
	Сп = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
				   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
				   //|		ПО Сотрудники.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	               |ГДЕ
	               |	НЕ Сотрудники.ВАрхиве
				   |	И Сотрудники.а_Авто <> ЗНАЧЕНИЕ(Справочник.Авто.ПустаяСсылка)";
				   //|	И КадроваяИсторияСотрудниковСрезПоследних.Должность.Наименование = ""Водій""
				   //|	И НЕ КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)";
	Т = Запрос.Выполнить().Выгрузить();
	Сп.ЗагрузитьЗначения(Т.ВыгрузитьКолонку("Ссылка"));
	Возврат Сп;
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВыбораИзСпискаВодителей(Результат, Парам2) Экспорт
	Если НЕ Результат = Неопределено Тогда
		Для Каждого Элемент Из Элементы.ПунктыРазгрузки.ВыделенныеСтроки Цикл
			ТекСтрока = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(Элемент);
			ТекСтрока.Водитель = Результат.Значение;
			
			Если ЗначениеЗаполнено(ЗначениеРеквизитаОбъекта(Результат.Значение, "а_Авто")) Тогда
				ТекСтрока.Авто = ЗначениеРеквизитаОбъекта(Результат.Значение, "а_Авто");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.ПунктыРазгрузки.Обновить();
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
КонецФункции

&НаКлиенте
Процедура СортироватьПоПодтвержденным(Команда)
	Объект.ПунктыРазгрузки.Сортировать("Обработано");
КонецПроцедуры

// Test}
#КонецОбласти

&НаКлиенте
Процедура ВыделениеНоменклатурыНоменклатураПриИзменении(Элемент)
	ВыделениеНоменклатурыИзменениеКоличества();
КонецПроцедуры

&НаКлиенте
Процедура ВыделениеНоменклатурыИзменениеКоличества()
	
	Если Объект.ВыделениеНоменклатуры.Количество() Тогда
	
		Элементы.Группа2.Заголовок = СтрШаблон("Товари без залишків (%1)", Объект.ВыделениеНоменклатуры.Количество());
		Элементы.Группа2.ЗаголовокСвернутогоОтображения = Элементы.Группа2.Заголовок;
	
	КонецЕсли;
	
	ВыделениеНоменклатурыИзменениеКоличестваНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыделениеНоменклатурыИзменениеКоличестваНаСервере()
	ЭтаФорма.УсловноеОформление.Элементы[3].Отбор.Элементы[0].ПравоеЗначение.ЗагрузитьЗначения(
		Объект.ВыделениеНоменклатуры.Выгрузить().ВыгрузитьКолонку("Номенклатура")
	);
КонецПроцедуры


&НаКлиенте
Процедура СтадияВыполнено(Команда)
	ВыделенныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	
	Для Каждого С Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(С);
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.СтадияВыполнена = Не ТекДанные.СтадияВыполнена;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СтадияГотовыеДокументы(Команда)
	ВыделенныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	
	Для Каждого С Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(С);
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.СтадияГотовыеДокументы = Не ТекДанные.СтадияГотовыеДокументы;
		КонецЕсли;
	КонецЦикла;КонецПроцедуры


&НаКлиенте
Процедура СтадияОбработан(Команда)
	ВыделенныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	
	Для Каждого С Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(С);
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.СтадияОбработан = Не ТекДанные.СтадияОбработан;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СтадияПечатьНаСклад(Команда)
	ВыделенныеСтроки = Элементы.ПунктыРазгрузки.ВыделенныеСтроки;
	
	Для Каждого С Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(С);
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.СтадияПечатьСклад = Не ТекДанные.СтадияПечатьСклад;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуВывозаФакт()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	а_ДатаВывозаФакт.Идентификатор КАК Идентификатор,
	               |	а_ДатаВывозаФакт.ДатаВывозаФакт КАК ДатаВывозаФакт
	               |ИЗ
	               |	РегистрСведений.а_ДатаВывозаФакт КАК а_ДатаВывозаФакт
	               |ГДЕ
	               |	а_ДатаВывозаФакт.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		М = Объект.ПунктыРазгрузки.НайтиСтроки(Новый Структура("Идентификатор", Выборка.Идентификатор));		
		
		Для Каждого Эл Из М Цикл
			ЗаполнитьЗначенияСвойств(Эл, Выборка, "ДатаВывозаФакт");
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыйИдентификаторДату(Команда)
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	НовыйУИД = "ДопКол"+СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	Для Каждого С Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.Товары.НайтиПоИдентификатору(С);
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.Идентификатор = НовыйУИД;
			ТекДанные.ДатаОтгрузки = ?(ЗначениеЗаполнено(ТекДанные.ДатаОтгрузки), ТекДанные.ДатаОтгрузки, Объект.Дата);
		КонецЕсли;
	КонецЦикла;
	ТоварыКоличествоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказНаСборку(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаСоздатьЗаказНаСБоркуЗавершение", ЭтотОбъект, Элементы.ПунктыРазгрузки.ВыделенныеСтроки),
		НСтр("ru = 'Создать заказ на сборку?'; uk = 'Створити замовлення на збірку?'"),
		РежимДиалогаВопрос.ДаНет,
		,
		,
	);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаСоздатьЗаказНаСБоркуЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого С Из ДопПараметры Цикл
			ТекДанные = Объект.ПунктыРазгрузки.НайтиПоИдентификатору(С);
			Состояние(СтрШаблон("%1 от %2", ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки));
			Если Не ТекДанные = Неопределено Тогда
				СоздатьЗаказНаСборкуНаСервере(ТекДанные.Идентификатор, ТекДанные.ПунктРазгрузки, ТекДанные.ДатаОтгрузки, ТекДанные.ЗаказНаЗборку); 
			КонецЕсли;
		КонецЦикла;		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере


&НаСервере
Процедура СоздатьЗаказНаСборкуНаСервере(Идентификатор, ПунктРазгрузки, ДатаОтгрузки, ЗаказНаЗборку = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ПунктРазгрузки", ПунктРазгрузки);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПунктыРазгрузки.Идентификатор КАК Идентификатор,
	               |	ПунктыРазгрузки.ПунктРазгрузки КАК ПунктРазгрузки,
	               |	ЕСТЬNULL(а_ДатаВывозаФакт.ДатаВывозаФакт, ПунктыРазгрузки.ДатаОтгрузки) КАК ДатаОтгрузки,
	               |	Товары.Номенклатура КАК НоменклатураЗаявка,
	               |	Товары.Количество КАК Количество,
	               |	0 КАК КоличествоСобрано,
	               |	Товары.ДополнительныеАртикулы КАК ДополнительныеАртикулы,
	               |	ПунктыРазгрузки.Организация КАК Организация,
	               |	ПунктыРазгрузки.Склад КАК Склад,
	               |	ПунктыРазгрузки.Водитель КАК Водитель,
	               |	ПунктыРазгрузки.Авто КАК Авто,
	               |	ПунктыРазгрузки.Прицеп КАК Прицеп,
	               |	ТТ.Примечание КАК Примечание
	               |ИЗ
	               |	Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.ПунктыРазгрузки КАК ПунктыРазгрузки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.а_ДатаВывозаФакт КАК а_ДатаВывозаФакт
	               |		ПО ПунктыРазгрузки.Ссылка = а_ДатаВывозаФакт.Объект
	               |			И ПунктыРазгрузки.Идентификатор = а_ДатаВывозаФакт.Идентификатор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Товары КАК Товары
	               |		ПО ПунктыРазгрузки.Ссылка = Товары.Ссылка
	               |			И ПунктыРазгрузки.ПунктРазгрузки = Товары.ПунктРазгрузки
	               |			И ПунктыРазгрузки.ДатаОтгрузки = Товары.ДатаОтгрузки
	               |			И ПунктыРазгрузки.Идентификатор = Товары.Идентификатор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(Т.Примечание) КАК Примечание,
	               |			Т.ПунктРазгрузки КАК ПунктРазгрузки,
	               |			Т.Идентификатор КАК Идентификатор,
	               |			Т.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.Товары КАК Т
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Т.ПунктРазгрузки,
	               |			Т.Идентификатор,
	               |			Т.Ссылка) КАК ТТ
	               |		ПО (ТТ.Ссылка = ПунктыРазгрузки.Ссылка)
	               |			И (ТТ.ПунктРазгрузки = ПунктыРазгрузки.ПунктРазгрузки)
	               |			И (ТТ.Идентификатор = ПунктыРазгрузки.Идентификатор)
	               |ГДЕ
	               |	ПунктыРазгрузки.Идентификатор = &Идентификатор
	               |	И ПунктыРазгрузки.ПунктРазгрузки = &ПунктРазгрузки
	               |	И ПунктыРазгрузки.ДатаОтгрузки = &ДатаОтгрузки
	               |	И ПунктыРазгрузки.Ссылка = &Ссылка";
	
	Т = Запрос.Выполнить().Выгрузить();
	
	Если Не Т.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'По пункту разгрузки %1, дата %2 не найден товар'; uk = 'За пунктом розвантаження %1, дата %2 не знайдено товар'"),
				ПунктРазгрузки, ДатаОтгрузки
			)
		);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаказНаЗборку) Тогда
		ДокЗаказ = Документы.а_ЗаказНаСборку.СоздатьДокумент();
		ДокЗаказ.Заполнить(Неопределено);
		ДокЗаказ.Дата = Т[0].ДатаОтгрузки;
		ДокЗаказ.Склад = Т[0].Склад;
		ДокЗаказ.Примечание = Т[0].Примечание;
		ДокЗаказ.Организация = Т[0].Организация; 	
		ДокЗаказ.ПунктРазгрузки = ПунктРазгрузки;
		ДокЗаказ.Идентификатор = Идентификатор;
		ДокЗаказ.ДокументОснование = Объект.Ссылка;
		
		Попытка
			ДокЗаказ.Записать();
			ЗаказНаЗборку = ДокЗаказ.Ссылка;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	ДокЗаказ = ЗаказНаЗборку.ПолучитьОбъект();
	ДокЗаказ.Дата = Т[0].ДатаОтгрузки;
	ДокЗаказ.Склад = Т[0].Склад;
	ДокЗаказ.Примечание = Т[0].Примечание;
	ДокЗаказ.Организация = Т[0].Организация; 	
	ДокЗаказ.ПунктРазгрузки = ПунктРазгрузки;
	ДокЗаказ.Идентификатор = Идентификатор;
	ДокЗаказ.ДокументОснование = Объект.Ссылка;
	ДокЗаказ.Товары.Загрузить(Т);
	
	Попытка
		ДокЗаказ.Записать();
		Модифицированность = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры