
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();
	Результат.Вывести(КомпоновкаДанныхСервер.ВыполнитьСправочникСхемаКомпоновки(ПолучитьИзВременногоХранилища(АдресСхемы), "ТабличныйДокумент"));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресСхемы = Параметры.АдресСхемы;
	СправочникСхема = Параметры.СправочникСхема;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать("");
КонецПроцедуры
