////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий"
	);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВалютаЦены.Пустая() Тогда
		Объект.ВалютаЦены = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	// Test{20231206
	а_ПрограмнаяРаботаСФормами.РазместитьРеквизитНаФорме(ЭтаФорма, "а_Период",, "Объект.а_Период",,,,,, "ГруппаВалютаНДС",,);
	// Test}
	
КонецПроцедуры
