
&НаСервере
Функция ПолучитьСписокСотрудниковНаСервере()
	// Вставить содержимое обработчика.
	Данные = Новый Структура;
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних";
	УсловиеЗапроса = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		УсловиеЗапроса = УсловиеЗапроса + "
	               |	КадроваяИсторияСотрудниковСрезПоследних.Организация = &Организация";
		Запрос.Параметры.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Если Не УсловиеЗапроса = "" Тогда
	    	УсловиеЗапроса = УсловиеЗапроса + "
				   |	И";
		КонецЕсли;
		УсловиеЗапроса = УсловиеЗапроса + "
	               |	 КадроваяИсторияСотрудниковСрезПоследних.Подразделение = &Подразделение";
		Запрос.Параметры.Вставить("Подразделение",Подразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(Должность) Тогда
		Если Не УсловиеЗапроса = "" Тогда
	    	УсловиеЗапроса = УсловиеЗапроса + "
				   |	И";
		КонецЕсли;
		УсловиеЗапроса = УсловиеЗапроса + "
	               |	 КадроваяИсторияСотрудниковСрезПоследних.Должность = &Должность";
		Запрос.Параметры.Вставить("Должность",Должность);
	КонецЕсли;
	Если Не Сотрудник.Количество() = 0 Тогда
		Если Не УсловиеЗапроса = "" Тогда
	    	УсловиеЗапроса = УсловиеЗапроса + "
				   |	И";
		КонецЕсли;
		УсловиеЗапроса = УсловиеЗапроса + "
	               |	 КадроваяИсторияСотрудниковСрезПоследних.Сотрудник В (&Сотрудник)";
		Запрос.Параметры.Вставить("Сотрудник",Сотрудник.ВыгрузитьЗначения());
	КонецЕсли;
	Если Не УсловиеЗапроса = "" Тогда
		Запрос.Текст = Запрос.Текст + "
	               |ГДЕ";
		Запрос.Текст = Запрос.Текст + УсловиеЗапроса;
	КонецЕсли;
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	Данные.Вставить("Сотрудники",Массив);
	Данные.Вставить("График",График);
	Данные.Вставить("Пятидневка",ПонедельникПятница);
	Данные.Вставить("Шестидневка",Суббота);
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	Результат = ПолучитьСписокСотрудниковНаСервере();
	Оповестить("ВыбраныСотрудники", Новый Структура("ФормаВладелец, ВыбранСотрудник, Режим", ЭтаФорма.ВладелецФормы.УникальныйИдентификатор, Результат, "ВыбраныСотрудники"));
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
    Если Параметры.Свойство("Организация") Тогда
        // здесь код обработки параметра
		Организация = Параметры.Организация;
    КонецЕсли;
    Если Параметры.Свойство("Подразделение") Тогда
        // здесь код обработки параметра
		Подразделение = Параметры.Подразделение;
    КонецЕсли;
КонецПроцедуры
