Процедура РедактироватьКод(ЭтаФорма, Элемент, СтандартнаяОбработка = Ложь, Знач ТекущийКод = "") Экспорт
	
	СтандартнаяОбработка 	= Ложь;
	ПутьКДанным 			= ЭтаФорма.ДополнительныеСвойства.ПутьКДанным.Получить(Элемент.Имя);
	ТекущийКод 				= ?(ТекущийКод = "", Элемент.ТекстРедактирования, ТекущийКод);
		
	Если СтрНайти(ПутьКДанным,"ТекущиеДанные") Тогда
		
		ИмяТабличнойЧасти	= Лев(Сред(ПутьКДанным,10), СтрНайти(Сред(ПутьКДанным,10),".")-1);
		НомерСтроки			= ЭтаФорма.Элементы[ИмяТабличнойЧасти].ТекущиеДанные.НомерСтроки;
		ИмяЭлемента 		= СтрЗаменить(ПутьКДанным, "Элементы." + ИмяТабличнойЧасти + ".ТекущиеДанные.","");
		//ТекущийКод 			= ЭтаФорма.Объект[ИмяТабличнойЧасти][НомерСтроки - 1][ИмяЭлемента];
		
	Иначе
		
		ИмяТабличнойЧасти 	= "";
		НомерСтроки			= 0;
		ИмяЭлемента 		= СтрЗаменить(СтрЗаменить(ПутьКДанным, "Объект.", ""), "Запись.", "");
		//ТекущийКод 			= Элемент.ТекстРедактирования;//ЭтаФорма.Объект[ИмяЭлемента];
		
	КонецЕсли;
	
	ПараметрыФормы 			= Новый Структура();
	ПараметрыФормы.Вставить("КодДляРедактирования"					, ТекущийКод);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти"						, ИмяТабличнойЧасти);
	ПараметрыФормы.Вставить("НомерСтроки"							, НомерСтроки);
	ПараметрыФормы.Вставить("КодДляРедактированияПодсказка"			, Элемент.Подсказка);
	ПараметрыФормы.Вставить("РедактируемыйРеквизитИмя"				, ИмяЭлемента);
	
	НовФорма 				= ПолучитьФорму("Обработка.ИнструментКонсольКода.Форма.Форма", ПараметрыФормы, ЭтаФорма);
	НовФорма.Открыть();
	
КонецПроцедуры

